Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# MessageWslUsage
source: Copyright (c) Microsoft Corporation. All rights reserved. For privacy information about this product please visit https://aka.ms/privacy. Usage: wsl.exe [Argument] [Options...] [CommandLine] Arguments for running Linux binaries: If no command line is provided, wsl.exe launches the default shell. --exec, -e <CommandLine> Execute the specified command without using the default Linux shell. --shell-type <standard|login|none> Execute the specified command with the provided shell type. -- Pass the remaining command line as-is. Options: --cd <Directory> Sets the specified directory as the current working directory. If ~ is used the Linux user's home path will be used. If the path begins with a / character, it will be interpreted as an absolute Linux path. Otherwise, the value must be an absolute Windows path. --distribution, -d <DistroName> Run the specified distribution. --distribution-id <DistroGuid> Run the specified distribution ID. --user, -u <UserName> Run as the specified user. --system Launches a shell for the system distribution. Arguments for managing Windows Subsystem for Linux: --help Display usage information. --debug-shell Open a WSL2 debug shell for diagnostics purposes. --install [Distro] [Options...] Install a Windows Subsystem for Linux distribution. For a list of valid distributions, use 'wsl.exe --list --online'. Options: --enable-wsl1 Enable WSL1 support. --fixed-vhd Create a fixed-size disk to store the distribution. --from-file <Path> Install a distribution from a local file. --legacy Use the legacy distribution manifest. --location <Location> Set the install path for the distribution. --name <Name> Set the name of the distribution. --no-distribution Only install the required optional components, does not install a distribution. --no-launch, -n Do not launch the distribution after install. --version <Version> Specifies the version to use for the new distribution. --vhd-size <MemoryString> Specifies the size of the disk to store the distribution. --web-download Download the distribution from the internet instead of the Microsoft Store. --manage <Distro> <Options...> Changes distro specific options. Options: --move <Location> Move the distribution to a new location. --set-sparse, -s <true|false> Set the VHD of distro to be sparse, allowing disk space to be automatically reclaimed. --set-default-user <Username> Set the default user of the distribution. --resize <MemoryString> Resize the disk of the distribution to the specified size. --mount <Disk> Attaches and mounts a physical or virtual disk in all WSL 2 distributions. Options: --vhd Specifies that <Disk> refers to a virtual hard disk. --bare Attach the disk to WSL2, but don't mount it. --name <Name> Mount the disk using a custom name for the mountpoint. --type <Type> Filesystem to use when mounting a disk, if not specified defaults to ext4. --options <Options> Additional mount options. --partition <Index> Index of the partition to mount, if not specified defaults to the whole disk. --set-default-version <Version> Changes the default install version for new distributions. --shutdown Immediately terminates all running distributions and the WSL 2 lightweight utility virtual machine. Options: --force Terminate the WSL 2 virtual machine even if an operation is in progress. Can cause data loss. --status Show the status of Windows Subsystem for Linux. --unmount [Disk] Unmounts and detaches a disk from all WSL2 distributions. Unmounts and detaches all disks if called without argument. --uninstall Uninstalls the Windows Subsystem for Linux package from this machine. --update Update the Windows Subsystem for Linux package. Options: --pre-release Download a pre-release version if available. --version, -v Display version information. Arguments for managing distributions in Windows Subsystem for Linux: --export <Distro> <FileName> [Options] Exports the distribution to a tar file. The filename can be - for stdout. Options: --format <Format> Specifies the export format. Supported values: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Imports the specified tar file as a new distribution. The filename can be - for stdin. Options: --version <Version> Specifies the version to use for the new distribution. --vhd Specifies that the provided file is a .vhd or .vhdx file, not a tar file. This operation makes a copy of the VHD file at the specified install location. --import-in-place <Distro> <FileName> Imports the specified VHD file as a new distribution. This virtual hard disk must be formatted with the ext4 filesystem type. --list, -l [Options] Lists distributions. Options: --all List all distributions, including distributions that are currently being installed or uninstalled. --running List only distributions that are currently running. --quiet, -q Only show distribution names. --verbose, -v Show detailed information about all distributions. --online, -o Displays a list of available distributions for install with 'wsl.exe --install'. --set-default, -s <Distro> Sets the distribution as the default. --set-version <Distro> <Version> Changes the version of the specified distribution. --terminate, -t <Distro> Terminates the specified distribution. --unregister <Distro> Unregisters the distribution and deletes the root filesystem.
cs_cz: Copyright (c) Microsoft Corporation. Všechna práva vyhrazena. Informace o ochraně osobních údajů k tomuto produktu najdete na stránce https://aka.ms/privacy. Použití: wsl.exe [Argument] [Options...] [CommandLine] Argumenty pro spouštění binárních souborů Linuxu: Pokud není zadaný žádný příkazový řádek, spustí wsl.exe výchozí prostředí. --exec, -e <CommandLine> Spustí zadaný příkaz bez použití výchozího linuxového prostředí. --shell-type <standard|login|none> Spustí zadaný příkaz se zadaným typem prostředí. -- Předá zbývající příkazový řádek tak, jak je. Možnosti: --cd <Directory> Nastaví zadaný adresář jako aktuální pracovní adresář. Pokud se použije ~, použije se domovská cesta uživatele Linuxu. Pokud cesta začíná znakem /, bude interpretována jako absolutní cesta Linuxu. V opačném případě musí být hodnota absolutní cestou systému Windows. --distribution, -d <DistroName> Spustí zadanou distribuci. --distribution-id <DistroGuid> Spustí ID zadané distribuce. --user, -u <UserName> Spustí jako zadaný uživatel. --system Spustí prostředí pro distribuci systému. Argumenty pro správu Subsystému Windows pro Linux: --help Zobrazí informace o použití. --debug-shell Otevře prostředí ladění WSL2 pro diagnostické účely. --install [Distro] [Options...] Nainstaluje distribuci Subsystému Windows pro Linux. Seznam platných distribucí zobrazíte pomocí příkazu 'wsl.exe --list --online'. Možnosti: --enable-wsl1 Povolí podporu WSL1. --fixed-vhd Vytvořte disk s pevnou velikostí pro uložení distribuce. --from-file <Path> Nainstaluje distribuci z místního souboru. --legacy Použije starší verzi manifestu distribuce. --location <Location> Nastaví instalační cestu pro distribuci. --name <Name> Nastaví název distribuce. --no-distribution Nainstaluje pouze požadované volitelné součásti, nenainstaluje distribuci. --no-launch, -n Po instalaci nespustí distribuci. --version <Version> Určuje verzi, která se má použít pro novou distribuci. --vhd-size <MemoryString> Určuje velikost disku pro uložení distribuce. --web-download Stáhne distribuci z internetu namísto z Microsoft Storu. --manage <Distro> <Options...> Změní specifické možnosti distribuce. Možnosti: --move <Location> Přesuňte distribuci do nového umístění. --set-sparse, -s <true|false> Nastavte virtuální pevný disk distribuce na zhuštěný, což umožní automatické uvolnění místa na disku. --set-default-user <Username> Nastaví výchozího uživatele distribuce. --resize <MemoryString> Změní velikost disku distribuce na zadanou velikost. --mount <Disk> Propojí a připojí fyzický nebo virtuální disk ve všech distribucích WSL 2. Možnosti: --vhd Určuje, že <Disk> odkazuje na virtuální pevný disk. --bare Propojí disk s WSL2, ale nepřipojí ho. --name <Name> Připojí disk pomocí vlastního názvu přípojného bodu. --type <Type> Systém souborů, který se má použít při připojování disku. Pokud není zadaný, výchozí hodnota je ext4. --options <Options> Další možnosti připojení. --partition <Index> Index oddílu, který se má připojit. Pokud není zadaný, výchozí hodnota je celý disk. --set-default-version <Version> Změní výchozí verzi instalace pro nové distribuce. --shutdown Okamžitě ukončí všechny spuštěné distribuce a odlehčený užitkový virtuální počítač WSL 2. Možnosti: --force Ukončí virtuální stroj WSL 2, i když probíhá operace. Může způsobit ztrátu dat. --status Zobrazí stav Subsystému Windows pro Linux. --unmount [Disk] Odpojí disk a zruší jeho propojení u všech distribucí WSL2. Pokud proběhlo volání bez argumentu, odpojí se všechny disky a zruší se jejich propojení. --uninstall Odinstaluje balíček Subsystému Windows pro Linux z tohoto počítače. --update Aktualizuje balíček Subsystému Windows pro Linux. Možnosti: --pre-release Stáhne předběžnou verzi, pokud je k dispozici. --version, -v Zobrazí informace o verzi. Argumenty pro správu distribucí v Subsystému Windows pro Linux: --export <Distro> <FileName> [Options] Exportuje distribuci do souboru tar. Název souboru může být - pro stdout. Možnosti: --format <Format> Určuje formát exportu. Podporované hodnoty: tar, tar.gz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importuje zadaný soubor tar jako novou distribuci. Název souboru může být - pro stdin. Možnosti: --version <Version> Určuje verzi, která se má použít pro novou distribuci. --vhd Určuje, že poskytnutý soubor je soubor .vhd nebo .vhdx, nikoli soubor tar. Tato operace vytvoří kopii souboru VHD v zadaném umístění instalace. --import-in-place <Distro> <FileName> Importuje zadaný soubor .VHD jako novou distribuci. Tento virtuální pevný disk musí být naformátovaný typem systému souborů ext4. --list, -l [Options] Vypíše distribuce. Možnosti: --all Vypíše všechny distribuce, včetně distribucí, které se právě instalují nebo odinstalovávají. --running Vypíše pouze distribuce, které jsou aktuálně spuštěné. --quiet, -q Zobrazí pouze názvy distribucí. --verbose, -v Zobrazí podrobné informace o všech distribucích. --online, -o Zobrazí seznam dostupných distribucí pro instalaci pomocí 'wsl.exe --install'. --set-default, -s <Distro> Nastaví distribuci jako výchozí. --set-version <Distro> <Version> Změní verzi zadané distribuce. --terminate, -t <Distro> Ukončí zadanou distribuci. --unregister <Distro> Zruší registraci distribuce a odstraní kořenový systém souborů.
da_dk: Copyright (c) Microsoft Corporation. Alle rettigheder forbeholdes. Du kan finde oplysninger om beskyttelse af personlige oplysninger for dette produkt på https://aka.ms/privacy. Brug: wsl.exe [Argument] [Options...] [CommandLine] Argumenter for kørsel af binære Linux-filer: Hvis der ikke er angivet en kommandolinje, starter wsl.exe en standardshell. --exec, -e <CommandLine> Kør den angivne kommando uden brug af Linux-standardshellen. --shell-type <standard|login|none> Udfør den angivne kommando med den angivne shelltype. -- Overfør den resterende kommandolinje, som den er. Indstillinger: --cd <Directory> Fastsætter den angivne mappe som den aktuelle arbejdsmappe. Hvis ~ bruges, bruges Linux-brugerens sti til hjem. Hvis stien starter med tegnet /, fortolkes den som en absolut Linux-sti. Ellers skal værdien være en absolut Windows-sti. --distribution, -d <DistroName> Kør den angivne distribution. --distribution-id <DistroGuid> Kør det angivne distributions-id. --user, -u <UserName> Kør som den angivne bruger. --system Starter en shell for systemdistributionen. Argumenter til administration af Windows-undersystem til Linux: --help Vis brugsoplysninger. --debug-shell Åbn en WSL2-fejlfindingsshell til diagnosticeringsformål. --install [Distro] [Options...] Installér en distribution af Windows-undersystem til Linux. Du kan se en liste over gyldige distributioner ved at bruge 'wsl.exe --list --online'. Indstillinger: --enable-wsl1 Aktivér WSL1-support. --fixed-vhd Opret en disk med fast størrelse til lagring af distribution. --from-file <Path> Installér en distribution fra en lokal fil. --legacy Brug det ældre distributionsmanifest. --location <Location> Angiv installationsstien for distributionen. --name <Name> Angiv navnet på distributionen. --no-distribution Installér kun de påkrævede valgfrie komponenter. Der installeres ikke en distribution. --no-launch, -n Start ikke distributionen efter installationen. --version <Version> Angiver den version, der skal bruges til den nye distribution. --vhd-size <MemoryString> Angiver størrelsen på disken, hvor distributionen skal gemmes. --web-download Download distributionen fra internettet i stedet for Microsoft Store. --manage <Distro> <Options...> Ændrer distributionsspecifikke indstillinger. Indstillinger: --move <Location> Flyt distributionen til en ny placering. --set-sparse, -s <true|false> Angiv VHD for distribution til sparse, hvilket gør det muligt at frigøre diskplads automatisk. --set-default-user <Username> Angiv standardbrugeren af distributionen. --resize <MemoryString> Tilpas størrelsen på disken til distributionen til den angivne størrelse. --mount <Disk> Tilknytter og indsætter en fysisk eller virtuel disk i alle WSL 2-distributioner. Indstillinger: --vhd Angiver, at <Disk> refererer til en virtuel harddisk. --bare Indsætter disken til WSL2, men tilslutter den ikke. --name <Name> Indsætter disken ved hjælp af et brugerdefineret navn på tilslutningspunktet. --type <Type> Filsystem, der skal bruges, når en disk indsættes, hvis den ikke som standard er angivet til ext4. --options <Options> Yderligere indsætningsindstillinger. --partition <Index> Indeks for partitionen, der skal indsættes, hvis der ikke som standard er angivet for hele disken. --set-default-version <Version> Ændrer standardinstallationsversionen for nye distributioner. --shutdown Afslutter straks alle kørende distributioner og WSL 2 virtuel maskine med letvægtsfunktioner. Indstillinger: --force Afslut den virtuelle WSL 2-maskine, selvom en handling er i gang. Kan medføre tab af data. --status Vis status for Windows-undersystem til Linux. --unmount [Disk] Frakobler og fjerner tilknytningen mellem en disk og alle WSL2-distributioner. Frakobler og fjerner tilknytningen til alle diske, hvis de kaldes uden et argument. --uninstall Fjerner Windows-undersystem til Linux-pakken fra denne computer. --update Opdater pakken med Windows-undersystem til Linux. Indstillinger: --pre-release Download en pre-release, hvis den er tilgængelig. --version, -v Vis versionsoplysninger. Argumenter for administration af distributioner i Windows-undersystem til Linux: --export <Distro> <FileName> [Options] Eksporterer distributionen til en TAR-fil. Filnavnet kan være - for stdout. Indstillinger: --format <Format> Angiver eksportformatet. Understøttede værdier: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importerer den angivne TAR-fil som en ny distribution. Filnavnet kan være - for stdin. Indstillinger: --version <Version> Angiver den version, der skal bruges til den nye distribution. --vhd Angiver, at den angivne fil er en .vhd- eller.vhdx-fil, ikke en tar-fil. Denne handling opretter en kopi af VHD-filen på den angivne installationsplacering. --import-in-place <Distro> <FileName> Importerer den angivne VHD-fil som en ny distribution. Denne virtuelle harddisk skal være formateret med ext4-filsystemtypen. --list, -l [Options] Lister distributioner. Indstillinger: --all Vis alle distributioner, herunder distributioner, der installeres eller fjernes i øjeblikket. --running Vis kun distributioner, der kører i øjeblikket. --quiet, -q Vis kun distributionsnavne. --verbose, -v Vis detaljerede oplysninger om alle distributioner. --online, -o Viser en liste over tilgængelige distributioner for installationer med 'wsl.exe --install'. --set-default, -s <Distro> Angiver distributionen som standard. --set-version <Distro> <Version> Ændrer versionen af den angivne distribution. --terminate, -t <Distro> Afslutter den angivne distribution. --unregister <Distro> Fjerner distributionen og sletter rodfilsystemet.
de_de: Copyright (c) Microsoft Corporation. Alle Rechte vorbehalten. Datenschutzinformationen zu diesem Produkt finden Sie unter https://aka.ms/privacy. Syntax: wsl.exe [Argument] [Optionen...] [CommandLine] Argumente für die Ausführung von Linux-Binärdateien: Wenn keine Befehlszeile angegeben ist, startet wsl.exe die Standardshell. --exec, -e <CommandLine> Den angegebenen Befehl ausführen, ohne die Linux-Standardshell zu verwenden. --shell-type <standard|login|none> Den angegebenen Befehl mit dem angegebenen Shelltyp ausführen. -- Die verbleibende Befehlszeile unverändert übergeben. Optionen: --cd <Directory> Legt das angegebene Verzeichnis als aktuelles Arbeitsverzeichnis fest. Wenn ~ verwendet wird, wird der Heimatpfad des Linux-Benutzers verwendet. Wenn der Pfad mit einem /-Zeichen beginnt, wird er als absoluter Linux-Pfad interpretiert. Andernfalls muss der Wert ein absoluter Windows-Pfad sein. --distribution, -d <DistroName> Die angegebene Verteilung ausführen. --distribution-id <DistroGuid> Die angegebene Verteilungs-ID ausführen. --user, -u <UserName> Als angegebener Benutzer ausführen. --system Startet eine Shell für die Systemverteilung. Argumente für die Verwaltung des Windows-Subsystems für Linux: --help Nutzungsinformationen anzeigen. --debug-shell Eine WSL2-Debugshell zu Diagnosezwecken öffnen. --install [Verteilung] [Optionen...] Ein Windows-Subsystem für die Linux-Verteilung installieren. Verwenden Sie 'wsl.exe --list --online', um eine Liste gültiger Verteilungen zu erhalten. Optionen: --enable-wsl1 WSL1-Unterstützung aktivieren. --fixed-vhd Erstellen Sie einen Datenträger mit fester Größe, um die Verteilung zu speichern. --from-file <Path> Eine Verteilung aus einer lokalen Datei installieren. --legacy Das Legacy-Verteilungsmanifest verwenden. --location <Location> Den Installationspfad für die Verteilung festlegen. --name <Name> Den Namen der Verteilung festlegen. --no-distribution Nur die erforderlichen optionalen Komponenten und keine Distribution installieren. --no-launch, -n Starten Sie die Distribution nach der Installation nicht. --version <Version> Gibt die Version an, die für die neue Distribution verwendet werden soll. --vhd-size <MemoryString> Gibt die Größe des Datenträgers an, auf dem die Verteilung gespeichert werden soll. --web-download Laden Sie die Distribution aus dem Internet und nicht aus dem Microsoft Store herunter. --manage <Distro> <Options...> Ändert distributionsspezifische Optionen. Optionen: --move <Location> Verschieben Sie die Distribution an einen neuen Speicherort. --set-sparse, -s <true|false> Stellen Sie die VHDX der Distribution auf „Geringe Dichte“ ein, damit Speicherplatz automatisch zurückgewonnen werden kann. --set-default-user <Username> Den Standardbenutzer der Verteilung festlegen. --resize <MemoryString> Passen Sie die Größe des Datenträgers der Distribution auf die angegebene Größe an. --mount <Disk> Fügt einen physischen oder virtuellen Datenträger an alle WSL2-Distributionen an und bindet ihn ein. Optionen: --vhd Gibt an, dass <Disk> auf eine virtuelle Festplatte verweist. --bare Fügen Sie den Datenträger an WSL2 an, aber binden Sie ihn nicht ein. --name <Name> Binden Sie den Datenträger unter Verwendung eines benutzerdefinierten Namens für den Einbindepunkt ein. --type <Type> Beim Einbinden eines Datenträgers zu verwendendes Dateisystem. Wenn nicht angegeben, wird standardmäßig ext4 verwendet. --options <Options> Zusätzliche Optionen zum Einbinden. --partition <Index> Der Index der einzubindenden Partition. Sofern nicht angegeben, wird standardmäßig der gesamte Datenträger verwendet. --set-default-version <Version> Ändert die Standardinstallationsversion für neue Distributionen. --shutdown Beendet sofort alle ausgeführten Distributionen und die WSL 2. virtueller Computer mit einfachem Hilfsprogramm. Optionen: --force Beenden Sie den virtuellen WSL 2-Computer, auch wenn gerade ein Vorgang ausgeführt wird. Kann zu Datenverlust führen. --status Zeigt den Status des Windows-Subsystems für Linux an. --unmount [Datenträger] Demountet und trennt einen Datenträger von allen WSL2-Distributionen. Demountet und trennt alle Datenträger, wenn der Aufruf ohne Argument erfolgt. --uninstall Deinstalliert das Paket „Windows-Subsystem für Linux“ von diesem Computer. --update Aktualisieren Sie das Paket „Windows-Subsystem für Linux.“ Optionen: --pre-release Laden Sie gegebenenfalls eine Vorabversion herunter. --version, -v Versionsinformationen anzeigen. Argumente für die Verwaltung von Distributionen in Windows-Subsystem für Linux: --export <Distro> <FileName> [Optionen] Exportiert die Distribution in eine TAR-Datei. Der Dateiname kann „-“ für stdout sein. Optionen: --format <Format> Gibt das Exportformat an. Unterstützte Werte: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Optionen] Importiert die angegebene TAR-Datei als neue Distribution. Der Dateiname kann „-“ für stdin sein. Optionen: --version <Version> Gibt die Version an, die für die neue Distribution verwendet werden soll. --vhd Gibt an, dass es sich bei der bereitgestellten Datei um eine VHDX-Datei handelt, nicht um eine TAR-Datei. Dieser Vorgang erstellt eine Kopie der VHDX-Datei am angegebenen Installationsspeicherort. --import-in-place <Distro> <FileName> Importiert die angegebene VHDX-Datei als neue Distribution. Diese virtuelle Festplatte muss mit dem Dateisystemtyp EXT4 formatiert sein. --list, -l [Optionen] Listet Distributionen auf. Optionen: --all Listet alle Distributionen auf, einschließlich Distributionen, die derzeit installiert oder deinstalliert werden. --running Listet nur Distributionen auf, die derzeit ausgeführt werden. --quiet, -q Nur Distributionsnamen anzeigen. --verbose, -v Detaillierte Informationen zu allen Distributionen anzeigen. --online, -o Zeigt eine Liste der verfügbaren Distributionen für die Installation mit 'wsl.exe --install' an. --set-default, -s <Distro> Legt die Distribution als Standard fest. --set-version <Distro> <Version> Ändert die Version der angegebenen Distribution. --terminate, -t <Distro> Beendet die angegebene Distribution. --unregister <Distro> Hebt die Registrierung der Distribution auf und löscht das Stammdateisystem.
el_gr: Πνευματικά δικαιώματα (c) Microsoft Corporation. Με την επιφύλαξη παντός δικαιώματος. Για πληροφορίες απορρήτου σχετικά με αυτό το προϊόν, επισκεφθείτε τη διεύθυνση https://aka.ms/privacy. Χρήση: wsl.exe [Όρισμα] [Επιλογές...] [Γραμμή_Εντολών] Ορίσματα για την εκτέλεση δυαδικών αρχείων Linux: Αν δεν παρασχεθεί γραμμή εντολών, το wsl.exe εκκινεί το προεπιλεγμένο κέλυφος. --exec, -e <Γραμμή_Εντολών> Εκτέλεση της καθορισμένης εντολής χωρίς τη χρήση του προεπιλεγμένου κελύφους Linux. --shell-type <standard|login|none> Εκτέλεση της καθορισμένης εντολής με τον παρεχόμενο τύπο κελύφους. -- Διέλευση της υπόλοιπης γραμμής εντολών ως έχει. Επιλογές: --cd <Κατάλογος> Ορίζει τον καθορισμένο κατάλογο ως τον τρέχοντα κατάλογο εργασίας. Αν χρησιμοποιηθεί το ~, θα χρησιμοποιηθεί η κεντρική διαδρομή του χρήστη Linux. Αν η διαδρομή ξεκινά με τον χαρακτήρα /, θα ερμηνευτεί ως απόλυτη διαδρομή Linux. Διαφορετικά, η τιμή πρέπει να είναι μια απόλυτη διαδρομή Windows. --distribution, -d <ΌνομαΔιανομής> Εκτέλεση της καθορισμένης διανομής. --distribution-id <ID_Διανομής> Εκτέλεση του καθορισμένου ID διανομής. --user, -u <ΌνομαΧρήστη> Εκτέλεση ως ο καθορισμένος χρήστης. --system Εκκινεί ένα κέλυφος για τη διανομή συστήματος. Ορίσματα για τη διαχείριση του Υποσυστήματος Windows για Linux: --help Εμφάνιση πληροφοριών χρήσης. --debug-shell Άνοιγμα ενός κελύφους εντοπισμού σφαλμάτων WSL2 για διαγνωστικούς σκοπούς. --install [Διανομή] [Επιλογές...] Εγκατάσταση μιας διανομής Υποσυστήματος Windows για Linux. Για μια λίστα έγκυρων διανομών, χρησιμοποιήστε 'wsl.exe --list --online'. Επιλογές: --enable-wsl1 Ενεργοποίηση υποστήριξης WSL1. --fixed-vhd Δημιουργία ενός δίσκου σταθερού μεγέθους για την αποθήκευση της διανομής. --from-file <Διαδρομή> Εγκατάσταση μιας διανομής από ένα τοπικό αρχείο. --legacy Χρήση του μανιφέστου διανομής παλαιού τύπου. --location <Τοποθεσία> Ορισμός της διαδρομής εγκατάστασης για τη διανομή. --name <Όνομα> Ορισμός του ονόματος της διανομής. --no-distribution Εγκατάσταση μόνο των απαιτούμενων προαιρετικών στοιχείων, χωρίς εγκατάσταση διανομής. --no-launch, -n Να μην εκκινηθεί η διανομή μετά την εγκατάσταση. --version <Έκδοση> Καθορίζει την έκδοση που θα χρησιμοποιηθεί για τη νέα διανομή. --vhd-size <ΣυμβολοσειράΜνήμης> Καθορίζει το μέγεθος του δίσκου για την αποθήκευση της διανομής. --web-download Λήψη της διανομής από το διαδίκτυο αντί από το Microsoft Store. --manage <Διανομή> <Επιλογές...> Αλλαγή συγκεκριμένων επιλογών διανομής. Επιλογές: --move <Τοποθεσία> Μετακίνηση της διανομής σε νέα τοποθεσία. --set-sparse, -s <true|false> Ορισμός του VHD της διανομής ως sparse (αραιό), επιτρέποντας την αυτόματη ανάκτηση χώρου στον δίσκο. --set-default-user <ΌνομαΧρήστη> Ορισμός του προεπιλεγμένου χρήστη της διανομής. --resize <ΣυμβολοσειράΜνήμης> Αλλαγή μεγέθους του δίσκου της διανομής στο καθορισμένο μέγεθος. --mount <Δίσκος> Συνδέει και προσαρτά έναν φυσικό ή εικονικό δίσκο σε όλες τις διανομές WSL 2. Επιλογές: --vhd Καθορίζει ότι ο <Δίσκος> αναφέρεται σε εικονικό σκληρό δίσκο. --bare Σύνδεση του δίσκου στο WSL2, χωρίς προσάρτηση. --name <Όνομα> Προσάρτηση του δίσκου χρησιμοποιώντας προσαρμοσμένο όνομα για το σημείο προσάρτησης. --type <Τύπος> Σύστημα αρχείων προς χρήση κατά την προσάρτηση ενός δίσκου, αν δεν καθοριστεί, προεπιλέγεται το ext4. --options <Επιλογές> Πρόσθετες επιλογές προσάρτησης. --partition <Ευρετήριο> Ευρετήριο του διαμερίσματος προς προσάρτηση, αν δεν καθοριστεί, προεπιλέγεται ολόκληρος ο δίσκος. --set-default-version <Έκδοση> Αλλάζει την προεπιλεγμένη έκδοση εγκατάστασης για νέες διανομές. --shutdown Τερματίζει αμέσως όλες τις εκτελούμενες διανομές και την ελαφριά εικονική μηχανή βοηθητικών εφαρμογών του WSL 2. Επιλογές: --force Τερματίζει την εικονική μηχανή WSL 2 ακόμη και αν εκτελείται κάποια λειτουργία. Μπορεί να προκαλέσει απώλεια δεδομένων. --status Εμφάνιση της κατάστασης του Υποσυστήματος Windows για Linux. --unmount [Δίσκος] Εξαγάγει και αποσυνδέει έναν δίσκο από όλες τις διανομές WSL2. Εξαγάγει και αποσυνδέει όλους τους δίσκους αν κληθεί χωρίς όρισμα. --uninstall Απεγκαθιστά το πακέτο του Υποσυστήματος Windows για Linux από αυτόν τον υπολογιστή. --update Ενημέρωση του πακέτου Υποσυστήματος Windows για Linux. Επιλογές: --pre-release Λήψη έκδοσης προ-κυκλοφορίας αν είναι διαθέσιμη. --version, -v Εμφάνιση πληροφοριών έκδοσης. Ορίσματα για τη διαχείριση διανομών στο Υποσύστημα Windows για Linux: --export <Διανομή> <ΌνομαΑρχείου> [Επιλογές] Εξάγει τη διανομή σε ένα αρχείο tar. Το όνομα αρχείου μπορεί να είναι - για το stdout. Επιλογές: --format <Μορφή> Καθορίζει τη μορφή εξαγωγής. Υποστηριζόμενες τιμές: tar, tar.gz, tar.xz, vhd. --import <Διανομή> <ΤοποθεσίαΕγκατάστασης> <ΌνομαΑρχείου> [Επιλογές] Εισάγει το καθορισμένο αρχείο tar ως νέα διανομή. Το όνομα αρχείου μπορεί να είναι - για το stdin. Επιλογές: --version <Έκδοση> Καθορίζει την έκδοση που θα χρησιμοποιηθεί για τη νέα διανομή. --vhd Καθορίζει ότι το παρεχόμενο αρχείο είναι αρχείο .vhd ή .vhdx, όχι αρχείο tar. Αυτή η λειτουργία δημιουργεί ένα αντίγραφο του αρχείου VHD στην καθορισμένη τοποθεσία εγκατάστασης. --import-in-place <Διανομή> <ΌνομαΑρχείου> Εισάγει το καθορισμένο αρχείο VHD ως νέα διανομή. Αυτός ο εικονικός σκληρός δίσκος πρέπει να είναι μορφοποιημένος με τον τύπο συστήματος αρχείων ext4. --list, -l [Επιλογές] Παραθέτει διανομές. Επιλογές: --all Παράθεση όλων των διανομών, συμπεριλαμβανομένων των διανομών που εγκαθίστανται ή απεγκαθίστανται αυτήν τη στιγμή. --running Παράθεση μόνο των διανομών που εκτελούνται αυτήν τη στιγμή. --quiet, -q Εμφάνιση μόνο των ονομάτων διανομών. --verbose, -v Εμφάνιση λεπτομερών πληροφοριών για όλες τις διανομές. --online, -o Εμφανίζει μια λίστα διαθέσιμων διανομών για εγκατάσταση με το 'wsl.exe --install'. --set-default, -s <Διανομή> Ορίζει τη διανομή ως την προεπιλεγμένη. --set-version <Διανομή> <Έκδοση> Αλλάζει την έκδοση της καθορισμένης διανομής. --terminate, -t <Διανομή> Τερματίζει την καθορισμένη διανομή. --unregister <Διανομή> Καταργεί την καταχώρηση της διανομής και διαγράφει το ριζικό σύστημα αρχείων.
es_es: Copyright (c) Microsoft Corporation. Todos los derechos reservados. Para obtener información de privacidad sobre este producto, visite https://aka.ms/privacy. Uso: wsl.exe [Argumento] [Opciones...] [Línea de comandos] Argumentos para ejecutar archivos binarios de Linux: Si no se proporciona ninguna línea de comandos, wsl.exe inicia el shell predeterminado. --exec, -e <CommandLine> Ejecute el comando especificado sin usar el shell de Linux predeterminado. --shell-type <standard|login|none> Ejecute el comando especificado con el tipo de shell proporcionado. -- Pasa la línea de comandos restante tal cual. Opciones: --cd <Directory> Establece el directorio especificado como directorio de trabajo actual. Si se usa ~, se usará la ruta de acceso principal del usuario de Linux. Si la ruta de acceso comienza con un carácter /, se interpretará como una ruta de acceso absoluta de Linux. De lo contrario, el valor debe ser una ruta de acceso absoluta de Windows. --distribution, -d <DistroName> Ejecute la distribución especificada. --distribution-id <DistroGuid> Ejecute el id. de distribución especificado. --user, -u <UserName> Ejecutar como el usuario especificado. --system Inicia un shell para la distribución del sistema. Argumentos para administrar Subsistema de Windows para Linux: --help Mostrar información de uso. --debug-shell Abra un shell de depuración WSL2 con fines de diagnóstico. --install [Distribución] [Opciones...] Instale una distribución de Subsistema de Windows para Linux. Para obtener una lista de distribuciones válidas, use 'wsl.exe --list --online'. Opciones: --enable-wsl1 Habilitar compatibilidad con WSL1. --fixed-vhd Crea un disco de tamaño fijo para almacenar la distribución. --from-file <Path> Instala una distribución desde un archivo local. --legacy Usa el manifiesto de distribución heredado. --location <Location> Establece la ruta de instalación para la distribución. --name <Name> Establece el nombre de la distribución. --no-distribution Solo instalar los componentes opcionales necesarios, no instala una distribución. --no-launch, -n No inicies la distribución después de la instalación. --version <Version> Especifica la versión que se va a usar para la nueva distribución. --vhd-size <MemoryString> Especifica el tamaño del disco para almacenar la distribución. --web-download Descarga la distribución desde Internet en lugar de la Microsoft Store. --manage <Distro> <Options...> Cambia las opciones específicas de distribución. Opciones: --move <Location> Mueve la distribución a una nueva ubicación. --set-sparse, -s <true|false> Establece el VHD de distribución en disperso, lo que permite recuperar automáticamente el espacio en disco. --set-default-user <Username> Establece el usuario predeterminado de la distribución. --resize <MemoryString> Cambia el tamaño del disco de la distribución al tamaño especificado. --mount <Disk> Conecta y monta un disco físico o virtual en todas las distribuciones de WSL 2. Opciones: --vhd Especifica que <Disk> hace referencia a un disco duro virtual. --bare Conecta el disco a WSL2, pero no lo montes. --name <Name> Monta el disco con un nombre personalizado para el punto de montaje. --type <Tipo> Sistema de archivos que se va a usar al montar un disco. Si no se especifica, el valor predeterminado es ext4. --options <Options> Opciones de montaje adicionales. --partition <Index> Índice de la partición que se va a montar. Si no se especifica, el valor predeterminado es todo el disco. --set-default-version <Version> Cambia la versión de instalación predeterminada para las nuevas distribuciones. --shutdown Finaliza inmediatamente todas las distribuciones en ejecución y la máquina virtual de la utilidad ligera WSL 2. Opciones: --force Finaliza la máquina virtual WSL 2 incluso si hay una operación en curso. Puede provocar la pérdida de datos. --status Muestra el estado de Subsistema de Windows para Linux. --unmount [Disk] Desmonta y desasocia un disco de todas las distribuciones de WSL2. Desmonta y desasocia todos los discos si se llama sin argumento. --uninstall Desinstala el paquete de Subsistema de Windows para Linux de este equipo. --update Actualizar el paquete del Subsistema de Windows para Linux. Opciones: --pre-release Descargar una versión preliminar si está disponible. --version, -v Mostrar información de versión. Argumentos para administrar distribuciones en el Subsistema de Windows para Linux: --export <Distro> <FileName> [Options] Exporta la distribución a un archivo tar. El nombre de archivo puede ser - para stdout. Opciones: --format <Format> Especifica el formato de exportación. Valores admitidos: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importa el archivo tar especificado como una nueva distribución. El nombre de archivo puede ser - para stdin. Opciones: --version <Version> Especifica la versión que se va a usar para la nueva distribución. --vhd Especifica que el archivo proporcionado es un archivo .vhd o .vhdx, no un archivo tar. Esta operación realiza una copia del archivo VHD en la ubicación de instalación especificada. --import-in-place <Distro> <FileName> Importa el archivo VHD especificado como una nueva distribución. Este disco duro virtual debe tener el formato del tipo de sistema de archivos ext4. --list, -l [Options] Enumera las distribuciones. Opciones: --all Enumera todas las distribuciones, incluidas las distribuciones que se están instalando o desinstalando actualmente. --running Enumera solo las distribuciones que se están ejecutando actualmente. --quiet, -q Mostrar solo nombres de distribución. --verbose, -v Muestra información detallada sobre todas las distribuciones. --online, -o Muestra una lista de distribuciones disponibles para instalar con 'wsl.exe --install'. --set-default, -s <Distro> Establece la distribución como predeterminada. --set-version <Distro> <Version> Cambia la versión de la distribución especificada. --terminate, -t <Distro> Finaliza la distribución especificada. --unregister <Distro> Anula el registro de la distribución y elimina el sistema de archivos raíz.
fi_fi: Tekijänoikeus (c) Microsoft Corporation. Kaikki oikeudet pidätetään. Lisätietoja tämän tuotteen tietosuojasta löytyy osoitteesta https://aka.ms/privacy. Käyttö: wsl.exe [Argumentti] [Asetukset...] [Komentorivi] Linux-binaaritiedostojen suoritusargumentit: Jos komentoriville ei anneta tekstiä, wsl.exe käynnistää oletusliittymän. --exec, -e <CommandLine> Suorita määritetty komento käyttämättä oletusarvoista Linux-liittymää. --shell-type <standard|login|none> Suorita määritetty komento annetulla liittymätyypillä. -- Välitä jäljellä oleva komentorivi sellaisenaan. Asetukset: --cd <Directory> Asettaa määritetyn hakemiston nykyiseksi työhakemistoksi. Jos ~ on käytössä, käytetään Linux-käyttäjän kotipolkua. Jos polku alkaa merkillä /, se tulkitaan absoluuttiseksi Linux-poluksi. Muussa tapauksessa arvon on oltava absoluuttinen Windows-polku. --distribution, -d <DistroName> Suorita määritetty jakelu. --distribution-id <DistroGuid> Suorita määritetty jakelutunnus. --user, -u <UserName> Suorita määritettynä käyttäjänä. --system Käynnistää liittymän järjestelmän jakelua varten. Argumentit Windows-alijärjestelmän Linuxille hallintaan: --help Näytä käyttötiedot. --debug-shell Avaa WSL2-virheenkorjausliittymä diagnostiikkatarkoitusta varten. --install [Jakelu] [Asetukset...] Asenna jakelu Windows-alijärjestelmään Linuxille. Jos haluat luettelon kelvollisista jakeluista, käytä argumenttia 'wsl.exe --list --online'. Asetukset: --enable-wsl1 Ota WSL1-tuki käyttöön. --fixed-vhd Luo kooltaan kiinteä levy jakelun tallentamista varten. --from-file <Path> Asenna jakelu paikallisesta tiedostosta. --legacy Käytä vanhoja jakelun kokoonpanotietoja. --location <Location> Määritä jakelun asennuspolku. --name <Name> Määritä jakelun nimi. --no-distribution Asenna ainoastaan pakolliset valinnaiset komponentit, älä jakelua. --no-launch, -n Älä käynnistä jakelua asennuksen jälkeen. --version <Version> Määrittää uutta jakelua varten käytettävän version. --vhd-size <MemoryString> Määrittää jakelun tallennuslevyn koon. --web-download Lataa jakelu Internetistä Microsoft Storen sijaan. --manage <Distro> <Options...> Muuttaa tietyn jakelun asetuksia. Asetukset: --move <Location> Siirrä jakelu uuteen sijaintiin. --set-sparse, -s <true|false> Määritä jakelun virtuaalikiintolevy harvaksi, jolloin levytilaa voidaan vapauttaa automaattisesti. --set-default-user <Username> Määritä jakelun oletuskäyttäjä. --resize <MemoryString> Muuta jakelun levyn koko määritettyyn kokoon. --mount <Disk> Liittää ja ottaa käyttöön fyysisen tai virtuaalilevyn kaikissa WSL2-jakeluissa. Asetuksia: --vhd Määrittää, että <Disk> viittaa virtuaalikiintolevyyn. --bare Liitä levy WSL2:een, mutta älä ota sitä käyttöön. --name <Name> Ota levy käyttöön käyttäen mukautettua nimeä käyttöönottopisteelle. --type <Type> Tiedostojärjestelmä levyn käyttöönoton yhteydessä. Jos sitä ei ole määritetty, käytetään oletusarvoa ext4. --options <Options> Käyttöönoton lisäasetukset. --partition <Index> Käyttöön otettavan osion indeksi. Jos sitä ei ole määritetty, käytetään oletusarvoisesti koko levyä. --set-default-version <Version> Muuttaa uusien jakeluiden oletusasennusversiota. --shutdown Lopettaa kaikki käynnissä olevat jakelut ja WSL 2:n kevyen käytön näennäiskoneen. Asetuksia: --force Lopeta WSL 2 -virtuaalikone, vaikka toiminto olisi käynnissä. Voi aiheuttaa tietojen menettämisen. --status Näytä Windows-alijärjestelmän Linuxille tila. --unmount [Levy] Poistaa levyn käytöstä ja irrottaa sen kaikista WSL2-jakeluista. Poistaa käytöstä kaikki levyt ja irrottaa ne, jos sitä kutsutaan ilman argumenttia. --uninstall Poistaa Windows-alijärjestelmä Linuxille -paketin tästä tietokoneesta. --update Päivitä Windows-alijärjestelmä Linuxille -paketti. Asetuksia: --pre-release Lataa ennakkoversio, jos se on saatavilla. --version, -v Näytä versiotiedot. Argumentit Windows-alijärjestelmän Linuxille jakelujen hallintaan: --export <Distro> <FileName> [Asetukset] Vie jakelun tar-tiedostoon. Tiedostonimi voi olla - STDOUT-siirrännälle. Asetuksia: --format <Format> Määrittää vientimuodon. Tuetut arvot: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Asetukset] Tuo määritetyn tar-tiedoston uutena jakeluna. Tiedostonimi voi olla - STDIN-siirrännälle. Asetuksia: --version <Version> Määrittää uudelle jakelulle käytettävän version. --vhd Määrittää, että annettu tiedosto on .vhd- tai .vhdx-tiedosto, ei tar-tiedosto. Tämä toiminto tekee VHD-tiedostosta kopion määritetyssä asennussijainnissa. --import-in-place <Distro> <FileName> Tuo määritetyn VHD-tiedoston uutena jakeluna. Tämä virtuaalikiintolevy on alustettava ext4-tiedostojärjestelmän tyypillä. --list, -l [Asetukset] Näyttää luettelon jakeluista. Asetuksia: --all Näytä luettelo kaikista jakeluista, mukaan lukien jakelut, joita asennetaan tai joiden asennusta poistetaan parhaillaan. --running Näytä vain parhaillaan käynnissä olevien jakeluiden luettelo. --quiet, -q Näytä vain jakeluiden nimet. --verbose, -v Näytä yksityiskohtaiset tiedot kaikista jakeluista. --online, -o Näyttää luettelon asennettavissa olevista jakeluista argumentilla wsl.exe --install'. --set-default, -s <Distro> Määrittää jakelun oletukseksi. --set-version <Distro> <Version> Muuttaa määritetyn jakelun versiota. --terminate, -t <Distro> Lopettaa määritetyn jakelun. --unregister <Distro> Poistaa jakelun rekisteröinnin ja päätiedostojärjestelmän.
fr_fr: Copyright (c) Microsoft Corporation. Tous droits réservés. Pour plus d’informations sur la confidentialité de ce produit, veuillez consulter https://aka.ms/privacy. Utilisation : wsl.exe [Argument] [Options...] [Ligne de commande] Arguments pour l’exécution des fichiers binaires Linux : Si aucune ligne de commande n’est fournie, wsl.exe lance l’interpréteur de commandes par défaut. --exec, -e <CommandLine> Exécute la commande spécifiée sans utiliser l’interpréteur de commandes Linux par défaut. --shell-type <standard|login|none> Exécute la commande spécifiée avec le type d’interpréteur de commandes fourni. -- Passe la ligne de commande restante « en l’état ». Options : --cd <Directory> Définit le répertoire spécifié comme répertoire de travail actuel. Si ~ est utilisé, le chemin d’accès personnel de l’utilisateur Linux est utilisé. Si le chemin commence par un caractère /, il est interprété en tant que chemin d’accès Linux absolu. Sinon, la valeur doit être un chemin Windows absolu. --distribution, -d <DistroName> Exécute la distribution spécifiée. --distribution-id <DistroGuid> Exécute l’ID de distribution spécifié. --user, -u <UserName> Exécute en tant que l’utilisateur spécifié. --system Lance un interpréteur de commandes pour la distribution du système. Arguments pour la gestion du sous-système Windows pour Linux : --help Affiche les informations d’utilisation. --debug-shell Ouvre un interpréteur de commandes de débogage WSL2 pour le diagnostic. --install [Distro] [Options...] Installe une distribution de sous-système Windows pour Linux. Pour obtenir une liste des distributions valides, utilisez 'wsl.exe --list --online'. Options : --enable-wsl1 Active la prise en charge de WSL1. --fixed-vhd Crée un disque de taille fixe pour stocker la distribution. --from-file <Path> Installe une distribution à partir d’un fichier local. --legacy Utilise le manifeste de distribution hérité. --location <Location> Définit le chemin d’installation de la distribution. --name <Name> Définit le nom de la distribution. --no-distribution Installe uniquement les composants facultatifs requis ; n’installe pas une distribution. --no-launch, -n Ne lance pas la distribution après l’installation. --version <Version> Spécifie la version à utiliser pour la nouvelle distribution. --vhd-size <MemoryString> Spécifie la taille du disque pour stocker la distribution. --web-download Télécharge la distribution à partir d’Internet au lieu de la Microsoft Store. --manage <Distro> <Options...> Modifie les options spécifiques à la distribution. Options : --move <Location> Déplace la distribution vers un nouvel emplacement. --set-sparse, -s <true|false> Définit le disque dur virtuel de la distribution pour qu’il soit clairsemé. Cela permet de récupérer automatiquement de l’espace disque. --set-default-user <Username> Définit l’utilisateur par défaut de la distribution. --resize <MemoryString> Redimensionne le disque de la distribution à la taille spécifiée. --mount <Disk> Attache et monte un disque physique ou virtuel dans toutes les distributions WSL 2. Options : --vhd Spécifie que <Disque> fait référence à un disque dur virtuel. --bare Attache le disque à WSL2, mais ne le monte pas. --name <Name> Monte le disque à l’aide d’un nom personnalisé pour le point de montage. --type <Type> Le système de fichiers à utiliser lors du montage d’un disque, s’il n’est pas spécifié par défaut, est ext4. --options <Options> Options de montage supplémentaires. --partition <Index> L’index de la partition à monter, s’il n’est pas spécifié par défaut, correspond à l’ensemble du disque. --set-default-version <Version> Modifie la version d’installation par défaut pour les nouvelles distributions. --shutdown Arrête immédiatement toutes les distributions en cours d’exécution ainsi que WSL 2 machine virtuelle utilitaire légère. Options : --force Terminez la machine virtuelle WSL 2 même si une opération est en cours. Peut entraîner une perte de données. --status Afficher l’état du Sous-système Windows pour Linux. --unmount [Disk] Démonte et détache un disque de toutes les distributions WSL2. Démonte et détache tous les disques s’ils sont appelés sans argument. --uninstall Désinstalle le package Sous-système Windows pour Linux de cet ordinateur. --update Mettez à jour le package Sous-système Windows pour Linux. Options : --pre-release Téléchargez une version préliminaire si disponible. --version, -v Affichez les informations de version. Arguments pour la gestion des distributions dans Sous-système Windows pour Linux : --export <Distro> <FileName> [Options] Exporte la distribution dans un fichier tar. Le nom de fichier peut être - pour stdout. Options : --format <Format> Spécifie le format d’exportation. Valeurs prises en charge : tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importe le fichier tar spécifié en tant que nouvelle distribution. Le nom de fichier peut être : pour stdin. Options : --version <Version> Spécifie la version à utiliser pour la nouvelle distribution. --vhd Spécifie que le fichier fourni est un fichier .vhd ou .vhdx, et non un fichier tar. Cette opération effectue une copie du fichier VHD à l’emplacement d’installation spécifié. --import-in-place <Distro> <FileName> Importe le fichier VHD spécifié en tant que nouvelle distribution. Ce disque dur virtuel doit être formaté avec le type de système de fichiers ext4. --list, -l [Options] Répertorie les distributions. Options : --all Répertorier toutes les distributions, y compris les distributions qui sont en cours d’installation ou de désinstallation. --running Répertorie uniquement les distributions en cours d’exécution. --quiet, -q Afficher uniquement les noms de distribution. --verbose, -v Afficher des informations détaillées sur toutes les distributions. --online, -o Affiche la liste des distributions disponibles pour l’installation avec 'wsl.exe --install'. --set-default, -s <Distro> Définit la distribution comme valeur par défaut. --set-version <Distro> <Version> Modifie la version de la distribution spécifiée. --terminate, -t <Distro> Met fin à la distribution spécifiée. --unregister <Distro> Annule l’inscription de la distribution et supprime le système de fichiers racine.
hu_hu: Szerzői jog (c) Microsoft Corporation. Minden jog fenntartva. További információ a termékről: https://aka.ms/privacy. Használat: wsl.exe [Argumentum] [Kapcsolók...] [Parancssor] Linuxos bináris fájlok futtatására szolgáló argumentumok: Ha nincs megadva parancssor, a wsl.exe az alapértelmezett rendszerhéjat indítja el. --exec, -e <CommandLine> A megadott parancs végrehajtása az alapértelmezett Linux-rendszerhéj használata nélkül. --shell-type <standard|login|none> A megadott parancs végrehajtása a megadott rendszerhéjtípussal. -- A parancssor fennmaradó részének átadása változtatás nélkül. Kapcsolók: --cd <Könyvtár> A megadott könyvtár aktuális munkakönyvtárként való beállítása. Tilde (~) karakter használata esetén a rendszer a Linux-felhasználó kezdőkönyvtárának elérési útját használja. Ha az elérési út perjel (/) karakterrel kezdődik, a rendszer az elérési utat linuxos abszolút elérési útként értelmezi. Ellenkező esetben az értéknek windowsos abszolút elérési útnak kell lennie. --distribution, -d <DisztribúcióNév> A megadott disztribúció futtatása. --distribution-id <DisztribúcióGuid> A megadott disztribúcióazonosító futtatása. --user, -u <Felhasználónév> Futtatás a megadott felhasználóként. --system A rendszer-disztribúció rendszerhéjának indítása. A Linuxos Windows-alrendszer kezelésére szolgáló argumentumok: --help Használati információk megjelenítése. --debug-shell A WSL2 hibakeresési rendszerhéjának diagnosztikai célból történő megnyitása. --install [Disztribúció] [Kapcsolók...] WSL-disztribúció telepítése. Az érvényes disztribúciók listája a 'wsl.exe --list --online' paranccsal jeleníthető meg. Kapcsolók: --enable-wsl1 A WSL1-támogatás engedélyezése. --fixed-vhd Rögzített méretű lemez létrehozása a disztribúció tárolásához. --from-file <ElérésiÚt> Disztribúció telepítése helyi fájlból. --legacy Az örökölt disztribúciós jegyzékfájl használata. --location <Hely> A disztribúció telepítési útvonalának beállítása. --name <Név> A disztribúció nevének beállítása. --no-distribution Csak a szükséges választható összetevők telepítése, a disztribúció telepítésének mellőzése. --no-launch, -n A disztribúció telepítés utáni elindításának mellőzése. --version <Verzió> Az új disztribúcióhoz használandó verzió megadása. --vhd-size <MemoriaSztring> A disztribúció tárolására szolgáló lemez méretének megadása. --web-download A disztribúció letöltése az internetről a Microsoft Store helyett. --manage <Disztribúció> <Kapcsolók...> A disztribúcióspecifikus beállítások módosítása. Kapcsolók: --move <Hely> A disztribúció áthelyezése egy új helyre. --set-sparse, -s <true|false> A disztribúció VHD-fájljának sparse értékre állítása, hogy a lemezterület automatikusan visszanyerhető legyen. --set-default-user <Felhasználónév> A disztribúció alapértelmezett felhasználójának beállítása. --resize <MemoriaSztring> A disztribúció lemezének átméretezése a megadott méretre. --mount <Lemez> Fizikai vagy virtuális lemez hozzárendelése és csatlakoztatása az összes WSL 2-disztribúcióban. Kapcsolók: --vhd Annak megadása, hogy a <Lemez> virtuális merevlemezre vonatkozik. --bare A lemezt WSL2-höz való hozzárendelése csatlakoztatás nélkül. --name <Név> A lemez csatlakoztatása egyéni csatlakoztatásipont-név használatával. --type <Típus> Lemez csatlakoztatásához használandó fájlrendszer. Ha nincs megadva, az alapértelmezett érték az ext4. --options <Kapcsolók> További csatlakoztatási lehetőségek. --partition <Index> A csatlakoztatni kívánt partíció indexe. Ha nincs megadva, az alapértelmezett érték a teljes lemez. --set-default-version <Verzió> Az új disztribúciók alapértelmezett telepítési verziójának módosítása. --shutdown Az összes futó disztribúció és a WSL 2 egyszerűsített segédprogram virtuális gépének azonnali leállítása. Kapcsolók: --force A WSL 2 virtuális gép leállítása még akkor is, ha egy művelet folyamatban van. Adatvesztést okozhat. --status A Linuxos Windows-alrendszer állapotának megjelenítése. --unmount [Lemez] Lemez leválasztása és és a hozzárendelés megszüntetése a WSL2 összes disztribúciójára vonatkozóan. Az összes lemez leválasztása és a hozzárendelésük megszüntetése, ha a meghívás argumentum nélkül történik. --uninstall A Linuxos Windows-alrendszer csomag eltávolítása erről a gépről. --update 0A Linuxos Windows-alrendszer csomagjának frissítése. Kapcsolók: --pre-release Előzetes verzió letöltése, ha elérhető. --version, -v Verzióinformációk megjelenítése. A disztribúciók Linuxos Windows-alrendszerben való kezelésére szolgáló argumentumok: --export <Disztribúció> <Fájlnév> [Kapcsolók] A disztribúció exportálása .tar fájlba. A fájlnév stdout esetén kötőjel (-) is lehet. Kapcsolók: --format <Formátum> Az exportálási formátum megadása. Támogatott értékek: tar, tar.gz, tar.xz, vhd. --import <Disztribúció> <TelepítésiHely> <Fájlnév> [Kapcsolók] A megadott .tar fájl importálása új disztribúcióként. A fájlnév stdin esetén kötőjel (-) is lehet. Kapcsolók: --version <Verzió> Az új disztribúcióhoz használandó verzió megadása. --vhd Azt adja meg, hogy a megadott fájl .vhd vagy .vhdx fájl, nem .tar fájl. Ez a művelet másolatot készít a VHD-fájlról a megadott telepítési helyen. --import-in-place <Disztribúció> <Fájlnév> A megadott VHD-fájl importálása új disztribúcióként. Ezt a virtuális merevlemezt az ext4 fájlrendszertípussal kell formázni. --list, -l [Kapcsolók] A disztribúciók listázása. Kapcsolók: --all Az összes disztribúciót listázza, beleértve a jelenleg telepítés vagy eltávolítás alatt állókat is. --running Csak a jelenleg futó disztribúciók listázása. --quiet, -q Csak a disztribúciók nevének megjelenítése. --verbose, -v Az összes disztribúció részletes adatainak megjelenítése. --online, -o A 'wsl.exe --install' paranccsal telepíthető elérhető disztribúciók listájának megjelenítése. --set-default, -s <Disztribúció> A disztribúció beállítása alapértelmezettként. --set-version <Disztribúció> <Verzió> A megadott disztribúció verziójának módosítása. --terminate, -t <Disztribúció> A megadott disztribúció leállítása. --unregister <Disztribúció> A disztribúció regisztrációjának megszüntetése és a gyökérszintű fájlrendszer törlése.
it_it: Copyright (c) Microsoft Corporation. Tutti i diritti sono riservati. Per informazioni sulla privacy di questo prodotto, visita https://aka.ms/privacy. Sintassi: wsl.exe [Argument] [Options...] [CommandLine] Argomenti per l'esecuzione di file binari Linux: Se non viene specificata alcuna riga di comando, wsl.exe avvia la shell predefinita. --exec, -e <CommandLine> Esegui il comando specificato senza usare la shell Linux predefinita. --shell-type <standard|login|none> Esegui il comando specificato con il tipo di shell fornito. -- Passa la riga di comando rimanente senza modifiche. Opzioni: --cd <Directory> Imposta la directory specificata come directory di lavoro corrente. Se viene usato ~, verrà usato il percorso home dell'utente Linux. Se il percorso inizia con un carattere /, verrà interpretato come un percorso Linux assoluto. In caso contrario, il valore deve essere un percorso assoluto di Windows. --distribution, -d <DistroName> Esegui la distribuzione specificata. --distribution-id <DistroGuid> Esegui l'ID distribuzione specificato. --user, -u <UserName> Esegui il comando con il nome utente specificato. --system Avvia una shell per la distribuzione del sistema. Argomenti per la gestione del sottosistema Windows per Linux: --help Visualizza le informazioni sulla sintassi. --debug-shell Apri una shell di debug WSL2 a scopo di diagnostica. --install [Distro] [Options...] Installa una distribuzione di un sottosistema Windows per Linux. Per un elenco di distribuzioni valide, usa 'wsl.exe --list --online'. Opzioni: --enable-wsl1 Abilita il supporto di WSL1. --fixed-vhd Crea un disco a dimensione fissa per archiviare la distribuzione. --from-file <Path> Installa una distribuzione da un file locale. --legacy Usa il manifesto della distribuzione legacy. --location <Location> Imposta il percorso di installazione per la distribuzione. --name <Name> Imposta il nome della distribuzione. --no-distribution Installa solo i componenti facoltativi necessari, senza installare una distribuzione. --no-launch, -n Non avviare la distribuzione dopo l'installazione. --version <Version> Specifica la versione da usare per la nuova distribuzione. --vhd-size <MemoryString> Specifica le dimensioni del disco in cui archiviare la distribuzione. --web-download Scarica la distribuzione da Internet anziché dal Microsoft Store. --manage <Distro> <Options...> Modifica le opzioni specifiche della distribuzione. Opzioni: --move <Location> Sposta la distribuzione in una nuova posizione. --set-sparse, -s <true|false> Imposta il VHD della distribuzione su sparse, consentendo il recupero automatico dello spazio su disco. --set-default-user <Username> Imposta l'utente predefinito della distribuzione. --resize <MemoryString> Ridimensiona il disco della distribuzione alle dimensioni specificate. --mount <Disk> Collega e monta un disco fisico o virtuale in tutte le distribuzioni WSL2. Opzioni: --vhd Specifica che <Disk> fa riferimento a un disco rigido virtuale. --bare Collega il disco a WSL2, senza montarlo. --name <Name> Monta il disco usando un nome personalizzato per il punto di montaggio. --type <Type> File system da usare durante il montaggio di un disco. Se non è specificato, il valore predefinito è ext4. --options <Options> Opzioni di montaggio aggiuntive. --partition <Index> Indice della partizione da montare. Se non è specificato, il valore predefinito è l'intero disco. --set-default-version <Version> Modifica la versione di installazione predefinita per le nuove distribuzioni. --shutdown Termina immediatamente tutte le distribuzioni in esecuzione e la macchina virtuale dell'utilità leggera WSL2. Opzioni: --force Termina la macchina virtuale WSL 2 anche se è in corso un'operazione. Può causare la perdita di dati. --status Mostra lo stato del sottosistema Windows per Linux. --unmount [Disk] Smonta e scollega un disco da tutte le distribuzioni WSL2. Smonta e scollega tutti i dischi se viene chiamata senza argomento. --uninstall Disinstalla il pacchetto sottosistema Windows per Linux da questo computer. --update Aggiorna il pacchetto del sottosistema Windows per Linux. Opzioni: --pre-release Scarica una versione non definitiva, se disponibile. --version, -v Mostra le informazioni sulla versione. Argomenti per la gestione delle distribuzioni del sottosistema Windows per Linux: --export <Distro> <FileName> [Options] Esporta la distribuzione in un file TAR. Il nome file può essere - per StdOut. Opzioni: --format <Format> Specifica il formato di esportazione. Valori supportati: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importa il file TAR specificato come nuova distribuzione. Il nome file può essere - per STDIN. Opzioni: --version <Version> Specifica la versione da usare per la nuova distribuzione. --vhd Specifica che il file fornito è un file con estensione vhd o vhdx, non un file TAR. Questa operazione crea una copia del file VHD nel percorso di installazione specificato. --import-in-place <Distro> <FileName> Importa il file VHD specificato come nuova distribuzione. Questo disco rigido virtuale deve essere formattato con il tipo di file system ext4. --list, -l [Options] Elenca le distribuzioni. Opzioni: --all Elenca tutte le distribuzioni, incluse quelle che al momento sono in fase di installazione o disinstallazione. --running Elenca solo le distribuzioni attualmente in esecuzione. --quiet, -q Mostra solo i nomi delle distribuzioni. --verbose, -v Mostra informazioni dettagliate su tutte le distribuzioni. --online, -o Visualizza un elenco di distribuzioni disponibili per l'installazione con 'wsl.exe --install'. --set-default, -s <Distro> Imposta la distribuzione come predefinita. --set-version <Distro> <Version> Cambia la versione della distribuzione specificata. --terminate, -t <Distro> Termina la distribuzione specificata. --unregister <Distro> Annulla la registrazione della distribuzione ed elimina il file system radice.
ja_jp: Copyright (c) Microsoft Corporation.All rights reserved. この製品のプライバシーに関する情報については、https://aka.ms/privacy にアクセスしてください。 使用法: wsl.exe [Argument] [Options...] [CommandLine] Linux バイナリを実行するための引数: コマンド ラインが指定されていない場合、wsl.exe は既定のシェルを起動します。 --exec, -e <CommandLine> 既定の Linux シェルを使用せずに、指定されたコマンドを実行します。 --shell-type <standard|login|none> 指定されたコマンドを、指定されたシェルの種類で実行します。 -- 残りのコマンド ラインをそのまま渡します。 オプション: --cd <Directory> 指定されたディレクトリを現在の作業ディレクトリとして設定します。 ~ が使用されている場合、Linux ユーザーのホーム パスが使用されます。パスが / 文字で始まる場合、絶対 Linux パスとして解釈されます。 それ以外の場合、値は絶対 Windows パスである必要があります。 --distribution, -d <DistroName> 指定されたディストリビューションを実行します。 --distribution-id <DistroGuid> 指定されたディストリビューション ID を実行します。 --user, -u <UserName> 指定されたユーザーとして実行します。 --system システム ディストリビューションのシェルを起動します。 Linux 用 Windows サブシステムを管理するための引数: --help 使用方法に関する情報を表示します。 --debug-shell 診断のために WSL2 デバッグ シェルを開きます。 --install [Distro] [Options...] Linux 用 Windows サブシステム ディストリビューションをインストールします。 有効なディストリビューションの一覧を表示するには、'wsl.exe --list --online' を使用します。 オプション: --enable-wsl1 WSL1 サポートを有効にします。 --fixed-vhd ディストリビューションを保存するための固定サイズのディスクを作成します。 --from-file <Path> ローカル ファイルからディストリビューションをインストールします。 --legacy レガシ ディストリビューション マニフェストを使用します。 --location <Location> ディストリビューションのインストール パスを設定します。 --name <Name> ディストリビューションの名前を設定します。 --no-distribution 必要なオプション コンポーネントのみをインストールし、ディストリビューションはインストールしません。 --no-launch, -n インストール後にディストリビューションを起動しません。 --version <Version> 新しいディストリビューションに使用するバージョンを指定します。 --vhd-size <MemoryString> ディストリビューションを保存するディスクのサイズを指定します。 --web-download Microsoft Store ではなく、インターネットからディストリビューションをダウンロードします。 --manage <Distro> <Options...> ディストリビューション固有のオプションを変更します。 オプション: --move <Location> ディストリビューションを新しい場所に移動します。 --set-sparse, -s <true|false> ディストリビューションの VHD をスパースに設定し、ディスク領域を自動的に解放できるようにします。 --set-default-user <Username> ディストリビューションの既定のユーザーを設定します。 --resize <MemoryString> ディストリビューションのディスクのサイズを指定したサイズに変更します。 --mount <Disk> 物理ディスクまたは仮想ディスクをすべての WSL 2 ディストリビューションにアタッチしてマウントします。 オプション: --vhd <Disk> が仮想ハード ディスクを参照することを指定します。 --bare ディスクを WSL2 にアタッチしますが、マウントはしません。 --name <Name> マウントポイントにカスタム名を使用してディスクをマウントします。 --type <Type> ディスクをマウントするときに使用するファイルシステム。指定しない場合は既定で ext4 になります。 --options <Options> 追加のマウント オプション。 --partition <Index> マウントするパーティションのインデックス。指定しない場合は既定でディスク全体になります。 --set-default-version <Version> 新しいディストリビューションの既定のインストール バージョンを変更します。 --shutdown 実行中のすべてのディストリビューションと WSL 2 の 軽量ユーティリティ仮想マシンを直ちに終了します。 オプション: --force 操作が進行中であっても、WSL 2 仮想マシンを終了します。データ損失を引き起こす可能性があります。 --status Linux 用 Windows サブシステムの状態を表示します。 --unmount [Disk] すべての WSL2 ディストリビューションからディスクのマウントを解除してデタッチします。 引数を指定せずに呼び出した場合、すべてのディスクのマウントを解除してデタッチします。 --uninstall このマシンから Linux 用 Windows サブシステム パッケージをアンインストールします。 --update Linux 用 Windows サブシステム パッケージを更新します。 オプション: --pre-release 利用可能な場合、プレリリース バージョンをダウンロードします。 --version, -v バージョン情報を表示します。 Linux 用 Windows サブシステムでディストリビューションを管理するための引数: --export <Distro> <FileName> [Options] ディストリビューションを tar ファイルにエクスポートします。 stdout の場合は、ファイル名に - を使用できます。 オプション: --format <Format> エクスポート形式を指定します。サポートされている値は、tar、tar.gz、tar.xz、vhd です。 --import <Distro> <InstallLocation> <FileName> [Options] 指定された tar ファイルを新しいディストリビューションとしてインポートします。 stdin の場合は、ファイル名に - を使用できます。 オプション: --version <Version> 新しいディストリビューションに使用するバージョンを指定します。 --vhd 指定されたファイルが tar ファイルではなく、.vhd または .vhdx ファイルであることを指定します。 この操作により、指定したインストール場所に VHD ファイルのコピーが作成されます。 --import-in-place <Distro> <FileName> 指定した VHD ファイルを新しいディストリビューションとしてインポートします。 この仮想ハード ディスクは、ext4 ファイルシステムの種類でフォーマットする必要があります。 --list, -l [Options] ディストリビューションを一覧表示します。 オプション: --all すべてのディストリビューションを一覧表示します。これには、 現在インストール中またはアンインストール中のディストリビューションが含まれます。 --running 現在実行中のディストリビューションのみを一覧表示します。 --quiet, -q ディストリビューション名のみを表示します。 --verbose, -v すべてのディストリビューションに関する詳細情報を表示します。 --online, -o 'wsl.exe --install' を使用してインストールできるディストリビューションの一覧を表示します。 --set-default, -s <Distro> このディストリビューションを既定として設定します。 --set-version <Distro> <Version> 指定されたディストリビューションのバージョンを変更します。 --terminate, -t <Distro> 指定されたディストリビューションを終了します。 --unregister <Distro> このディストリビューションの登録を解除し、ルート ファイルシステムを削除します。
ko_kr: Copyright (c) Microsoft Corporation. All rights reserved. 이 제품의 개인 정보 보호에 관한 정보는 https://aka.ms/privacy에서 확인하세요. 사용법: wsl.exe [Argument] [Options...] [CommandLine] Linux 이진 파일을 실행하기 위한 인수: 명령줄이 제공되지 않으면 wsl.exe는 기본 셸을 시작합니다. --exec, -e <CommandLine> 기본 Linux 셸을 사용하지 않고 지정된 명령을 실행합니다. --shell-type <standard|login|none> 제공된 셸 형식으로 지정된 명령을 실행합니다. -- 나머지 명령줄을 있는 그대로 전달합니다. 옵션: --cd <Directory> 지정된 디렉터리를 현재 작업 디렉터리로 설정합니다. ~가 사용되는 경우 Linux 사용자의 홈 경로가 사용됩니다. 경로가 / 문자로 시작하면 절대 Linux 경로로 해석됩니다. 그렇지 않으면 값이 절대 Windows 경로여야 합니다. --distribution, -d <DistroName> 지정된 배포를 실행합니다. --distribution-id <DistroGuid> 지정된 배포 ID를 실행합니다. --user, -u <UserName> 지정된 사용자로 실행합니다. --system 시스템 배포에 대한 셸을 시작합니다. Linux용 Windows 하위 시스템을 관리하기 위한 인수: --help 사용 정보를 표시합니다. --debug-shell 진단을 위해 WSL2 디버그 셸을 엽니다. --install [Distro] [Options...] Linux 배포용 Windows 하위 시스템을 설치합니다. 유효한 배포 목록의 경우 'wsl.exe --list --online'을 사용합니다. 옵션: --enable-wsl1 WSL1 지원을 사용하도록 설정합니다. --fixed-vhd 배포를 저장할 고정 크기 디스크를 만듭니다. --from-file <Path> 로컬 파일에서 배포를 설치합니다. --legacy 레거시 배포 매니페스트를 사용합니다. --location <Location> 배포에 대한 설치 경로를 설정합니다. --name <Name> 배포의 이름을 설정합니다. --no-distribution 필요한 선택적 구성 요소만 설치하고 배포를 설치하지 않습니다. --no-launch, -n 설치 후 배포를 시작하지 마세요. --version <Version> 새 배포에 사용할 버전을 지정합니다. --vhd-size <MemoryString> 배포를 저장할 디스크의 크기를 지정합니다. --web-download Microsoft Store 대신 인터넷에서 배포를 다운로드합니다. --manage <Distro> <Options...> 배포판 관련 옵션을 변경합니다. 옵션: --move <Location> 배포를 새 위치로 이동합니다. --set-sparse, -s <true|false> 배포판의 VHD를 스파스로 설정하여 디스크 공간을 자동으로 회수할 수 있도록 합니다. --set-default-user <Username> 배포의 기본 사용자를 설정합니다. --resize <MemoryString> 배포 디스크의 크기를 지정된 크기로 조정합니다. --mount <Disk> 모든 WSL 2 배포에서 실제 또는 가상 디스크를 연결하고 탑재합니다. 옵션: --vhd <디스크>가 가상 하드 디스크를 참조하도록 지정합니다. --bare 디스크를 WSL2에 연결하고 탑재하지는 마세요. --name <Name> 탑재 지점의 사용자 지정 이름을 사용하여 디스크를 탑재합니다. --type <Type> 디스크를 탑재할 때 사용할 파일 시스템이 지정되지 않은 경우 기본적으로 ext4입니다. --options <Options> 추가 탑재 옵션입니다. --partition <Index> 탑재할 파티션의 인덱스가 지정되지 않은 경우 기본값은 전체 디스크입니다. --set-default-version <Version> 새 배포에 대한 기본 설치 버전을 변경합니다. --shutdown 실행 중인 모든 배포와 WSL 2을 즉시 종료합니다. 경량 유틸리티 가상 머신입니다. 옵션: --force 작업이 진행 중인 경우에도 WSL 2 가상 머신을 종료합니다. 데이터 손실을 초래할 수 있습니다. --status Linux용 Windows 하위 시스템 상태를 표시합니다. --unmount [Disk] 모든 WSL2 배포에서 디스크를 해제하고 분리합니다. 인수 없이 호출되는 경우 모든 디스크를 해제하고 분리합니다. --uninstall 이 컴퓨터에서 Linux용 Windows 하위 시스템 패키지를 제거합니다. --update Linux용 Windows 하위 시스템 패키지를 업데이트합니다. 옵션: --pre-release 사용 가능한 경우 시험판 버전을 다운로드합니다. --version, -v 버전 정보를 표시합니다. Linux용 Windows 하위 시스템 배포를 관리하기 위한 인수: --export <Distro> <FileName> [Options] 배포를 tar 파일로 내보냅니다. 파일 이름은 - for stdout 일 수 있습니다. 옵션: --format <Format> 내보내기 형식을 지정합니다. 지원되는 값: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] 지정된 tar 파일을 새 배포로 가져옵니다. 파일 이름은 - for stdin 일 수 있습니다. 옵션: --version <Version> 새 배포에 사용할 버전을 지정합니다. --vhd 제공된 파일이 tar 파일이 아닌 .vhd 또는 .vhdx 파일임을 지정합니다. 이 작업은 지정된 설치 위치에 VHD 파일의 복사본을 만듭니다. --import-in-place <Distro> <FileName> 지정된 VHD 파일을 새 배포판으로 가져옵니다. 이 가상 하드 디스크는 ext4 파일 시스템 형식으로 포맷해야 합니다. --list, -l [Options] 배포를 나열합니다. 옵션: --all 배포를 포함하여 모든 배포를 나열합니다. 현재 설치 중이거나 제거되고 있습니다. --running 현재 실행 중인 배포만 나열합니다. --quiet, -q 배포 이름만 표시합니다. --verbose, -v 모든 배포에 대한 자세한 정보를 표시합니다. --online, -o 'wsl.exe --install'을 사용하여 설치에 사용할 수 있는 배포 목록을 표시합니다. --set-default, -s <Distro> 배포를 기본값으로 설정합니다. --set-version <Distro> <Version> 지정된 배포의 버전을 변경합니다. --terminate, -t <Distro> 지정된 배포를 종료합니다. --unregister <Distro> 배포를 등록 취소하고 루트 파일 시스템을 삭제합니다.
nb_no: Opphavsrett (c) Microsoft Corporation. Med enerett. Hvis du vil ha personverninformasjon om dette produktet, kan du gå til https://aka.ms/privacy. Bruk: wsl.exe [Argument] [Alternativer...] [Kommandolinje] Argumenter for å kjøre Linux-binærfiler: Hvis ingen kommandolinje er angitt, starter wsl.exe standardgrensesnittet. --exec, -e <CommandLine> Utfør den angitte kommandoen uten å bruke standard Linux shell. --shell-type <standard|login|none> Utfør den angitte kommandoen med den angitte skalltypen. -- Sender gjenstående kommandolinje slik den er. Options: --cd <Directory> Angir den angitte mappen som gjeldende arbeidsmappe. Hvis ~ brukes, brukes Linux-brukerens hjemmebane. Hvis banen begynner med et /-tegn, tolkes det som en absolutt Linux-bane. Ellers må verdien være en absolutt Windows-bane. --distribution, -d <DistroName> Kjør den angitte distribusjonen. --distribution-id <DistroGuid> Kjør den angitte distribusjons-ID-en. --user, -u <UserName> Kjør som den angitte brukeren. --system Starter et skall for systemdistribusjonen. Argumenter for behandling av Windows-undersystem for Linux: --help Vis bruksinformasjon. --debug-shell Åpne et WSL2 feilsøkingsskal til diagnoseformål. --install [Distro] [Alternativer ...] Installer et Windows-undersystem for Linux-distribusjon. For en liste over gyldige distribusjoner kan du bruke 'wsl.exe --list --online'. Alternativer: --enable-wsl1 Aktiver WSL1-støtte. --fixed-vhd Opprett en disk med fast størrelse for å lagre distribusjonen. --from-file <Path> Installer en distribusjon fra en lokal fil. --legacy Bruk det eldre distribusjonsmanifestet. --location <Location> Angi installasjonsbanen for distribusjonen. --name <Name> Angi navnet på distribusjonen. --no-distribution Installer kun de nødvendige valgfrie komponentene, installerer ikke en distribusjon. --no-launch, -n Ikke start distribusjonen etter installeringen. --version <Version> Angir versjonen som skal brukes til den nye distribusjonen. --vhd-size <MemoryString> Angir størrelsen på disken som skal lagre distribusjonen. --web-download Last ned distribusjonen fra internett i stedet for Microsoft Store. --manage <Distro> <Options...> Endrer bestemte alternativer for Distro. Alternativer: --move <Location> Flytt distribusjonen til en ny plassering. --set-sparse, -s <true|false> Angi at VHD-en for distro skal være spredt, slik at diskplass kan frigjøres automatisk. --set-default-user <Username> Angi standardbruker for distribusjonen. --resize <MemoryString> Endre størrelsen på disken i distribusjonen til den angitte størrelsen. --mount <Disk> Fester og monterer en fysisk eller virtuell disk i alle WSL 2-distribusjonene. Alternativer: --vhd Angir at <Disk> refererer til en virtuell harddisk. --bare Fest disken til WSL2, men ikke monter den. --name <Name> Monter disken med et egendefinert navn på monteringspunktet. --type <Type> Filsystem til bruk ved montering av disk, om ikke angitt settes det som standard til ext4. --options <Options> Flere monteringsalternativer. --partition <Index> Indeksen for partisjonen som skal monteres, hvis den ikke er angitt som standard for hele disken. --set-default-version <Version> Endrer standard installasjonsversjon for nye distribusjoner. --shutdown Avslutter umiddelbart alle kjørende distribusjoner og den virtuelle WSL 2 lightweight utility-maskinen. Alternativer: --force Avslutt den virtuelle WSL 2-maskinen selv om en operasjon pågår. Kan føre til tap av data. --status Vis statusen for Windows-undersystem for Linux. --unmount [Disk] Demonterer og kobler fra en disk fra alle WSL2-distribusjoner. Demonterer og løsner alle disker hvis de kalles uten argument. --uninstall Avinstallerer Windows-undersystem for Linux-pakken fra denne maskinen. --update Oppdaterer Windows-undersystem for Linux-pakken. Alternativer: --pre-release Last ned en forhåndsversjon hvis tilgjengelig. --version, -v Vis versjonsinformasjon. Argumenter for behandling av distribusjoner i Windows-undersystem for Linux: --export <Distro> <FileName> [Options] Eksporterer distribusjonen til en tjærefil. Filnavnet kan være - for stdout. Alternativer: --format <Format> Angir eksportformatet. Støttede verdier: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importerer den angitte tjærefilen som en ny distribusjon. Filnavnet kan være - for stdin. Alternativer: --version <Version> Angir versjonen som skal brukes i den nye distribusjonen. --vhd Angir at den angitte filen er en .vhd- eller .vhdx-fil, ikke en tjærefil. Denne operasjonen lager en kopi av VHD-filen på den angitte installasjonsplasseringen. --import-in-place <Distro> <FileName> Importerer den angitte VHD-filen som en ny distribusjon. Denne virtuelle harddisken må formateres med filsystemtypen ext4. --list, -l [Options] Viser distribusjoner. Alternativer: --all Viser alle distribusjoner, inkludert distribusjoner som for øyeblikket installeres eller avinstalleres. --running Viser kun distribusjoner som kjører for øyeblikket. --quiet, -q Viser bare distribusjonsnavn. --verbose, -v Viser detaljert informasjon om alle distribusjonene. --online, -o Viser en liste over tilgjengelige distribusjoner for installering med 'wsl.exe --install'. --set-default, -s <Distro> Angir distribusjonen som standard. --set-version <Distro> <Version> Endrer versjonen for den angitte distribusjonen. --terminate, -t <Distro> Avslutter den angitte distribusjonen. --unregister <Distro> Avregistrerer distribusjonen og sletter rotfilsystemet.
nl_nl: Copyright (c) Microsoft Corporation. Alle rechten voorbehouden. Ga naar https://aka.ms/privacy voor privacyinformatie over dit product. Gebruik: wsl.exe [Argument] [Opties...] [Opdrachtregel] Argumenten voor het uitvoeren van binaire Linux-bestanden: Als er geen opdrachtregel is opgegeven, wordt de standaardshell gestart met wsl.exe. --exec, -e <CommandLine> De opgegeven opdracht uitvoeren zonder de standaardshell voor Linux te gebruiken. --shell-type <standard|login|none> De opgegeven opdracht uitvoeren met het opgegeven shelltype. -- De resterende opdrachtregel in de huidige staat doorgeven. Opties: --cd <Directory> De opgegeven map instellen als de huidige werkmap. Als ~ wordt gebruikt, wordt het basispad van de Linux-gebruiker gebruikt. Als het pad begint met een /-teken, wordt het geïnterpreteerd als een absoluut Linux-pad. Anders moet de waarde een absoluut Windows-pad zijn. --distribution, -d <DistroName> De opgegeven distributie uitvoeren. --distribution-id <DistroGuid> De opgegeven distributie-id uitvoeren. --user, -u <UserName> Uitvoeren als de opgegeven gebruiker. --system Een shell voor de systeemdistributie starten. Argumenten voor het beheren van het Windows-subsysteem voor Linux: --help Gebruiksgegevens weergeven. --debug-shell Een WSL2-foutopsporingsshell voor diagnostische doeleinden openen. --install [Distro] [Options...] Een Windows-subsysteem voor Linux-distributie installeren. Gebruik 'wsl.exe --list --online' voor een lijst met geldige distributies. Opties: --enable-wsl1 WSL1-ondersteuning inschakelen. --fixed-vhd Een schijf met een vaste grootte maken om de distributie op te slaan. --from-file <Path> Een distributie installeren vanaf een lokaal bestand. --legacy Het verouderde distributiemanifest gebruiken. --location <Location> Het installatiepad voor de distributie instellen. --name <Name> De naam van de distributie instellen. --no-distribution Door alleen de vereiste optionele onderdelen te installeren, wordt geen distributie geïnstalleerd. --no-launch, -n De distributie niet na de installatie starten. --version <Version> Specificeert de versie die moet worden gebruikt voor de nieuwe distributie. --vhd-size <MemoryString> Specificeert de grootte van de schijf om de distributie op te slaan. --web-download De distributie downloaden van internet in plaats van Microsoft Store. --manage <Distro> <Options...> Hiermee worden specifieke opties voor de distributie gewijzigd. Opties: --move <Location> De distributie naar een nieuwe locatie verplaatsen. --set-sparse, -s <true|false> De VHD van de distributie instellen op sparse, zodat schijfruimte automatisch opnieuw kan worden geclaimd. --set-default-user <Username> De standaardgebruiker van de distributie instellen. --resize <MemoryString> De grootte van de schijf van de distributie wijzigen in de opgegeven grootte. --mount <Disk> Hiermee wordt een fysieke of virtuele schijf in alle WSL 2-distributies toegevoegd en gekoppeld. Opties: --vhd Hiermee geef je aan dat <Disk> naar een virtuele harde schijf verwijst. --bare De schijf toevoegen aan WSL2, maar niet koppelen. --name <Name> De schijf koppelen met een aangepaste naam voor het koppelpunt. --type <Type> Het bestandssysteem dat moet worden gebruikt bij het koppelen van een schijf wordt, indien niet opgegeven, standaard ingesteld op ext4. --options <Options> Aanvullende koppelingsopties. --partition <Index> De index van de partitie die moet worden gekoppeld wordt, indien niet opgegeven, standaard ingesteld op de hele schijf. --set-default-version <Version> Hiermee wijzig je de standaardinstallatieversie voor nieuwe distributies. --shutdown Hiermee beëindig je onmiddellijk alle actieve distributies en de WSL 2 lichtgewicht virtuele machine voor hulpprogramma's. Opties: --force De WSL 2-VM beëindigen, zelfs als er een bewerking wordt uitgevoerd. Dit kan gegevensverlies veroorzaken. --status De status van het Windows-subsysteem voor Linux weergeven. --unmount [Disk] Hiermee wordt een schijf ontkoppeld en losgemaakt van alle WSL2-distributies. Hiermee worden alle schijven ontkoppeld en losgemaakt bij een aanroep zonder argument. --uninstall Hiermee verwijder je het Windows-subsysteem voor Linux-pakket van deze computer. --update Het Windows-subsysteem voor Linux-pakket bijwerken. Opties: --pre-release Een voorlopige versie downloaden, indien beschikbaar. --version, -v Versiegegevens weergeven. Argumenten voor het beheren van distributies in het Windows-subsysteem voor Linux: --export <Distro> <FileName> [Opties] Hiermee exporteer je de distributie naar een TAR-bestand. De bestandsnaam kan - zijn voor stdout. Opties: --format <Format> Specificeert de exportindeling. Ondersteunde waarden: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Opties] Hiermee importeer je het opgegeven TAR-bestand als een nieuwe distributie. De bestandsnaam kan - zijn voor stdin. Opties: --version <Version> Hiermee geef je de versie op die moet worden gebruikt voor de nieuwe distributie. --vhd Hiermee geef je op dat het opgegeven bestand een VHD- of VHDX-bestand is en geen TAR-bestand. Met deze bewerking wordt een kopie gemaakt van het VHD-bestand op de opgegeven installatielocatie. --import-in-place <Distro> <FileName> Hiermee importeer je het opgegeven VHD-bestand als een nieuwe distributie. Deze virtuele harde schijf moet zijn geformatteerd met het ext4-type bestandssysteem. --list, -l [Opties] Hiermee wordt een lijst met distributies weergegeven. Opties: --all Alle distributies weergeven, inclusief distributies die momenteel worden geïnstalleerd of verwijderd. --running Alleen distributies weergeven die momenteel worden uitgevoerd. --quiet, -q Alleen distributienamen weergeven. --verbose, -v Gedetailleerde informatie over alle distributies weergeven. --online, -o Geeft een lijst weer met beschikbare distributies voor installatie met 'wsl.exe --install'. --set-default, -s <Distro> Hiermee stel je de distributie als standaard in. --set-version <Distro> <Version> Hiermee wijzig je de versie van de opgegeven distributie. --terminate, -t <Distro> Hiermee wordt de opgegeven distributie beëindigd. --unregister <Distro> De registratie van de distributie ongedaan maken en het hoofdbestandssysteem verwijderen.
pl_pl: Copyright (c) Microsoft Corporation. Wszelkie prawa zastrzeżone. Aby zapoznać się z informacjami o ochronie prywatności dotyczącymi tego produktu, odwiedź stronę https://aka.ms/privacy. Użycie: wsl.exe [Argument] [Options...] [CommandLine] Argumenty uruchamiania plików binarnych systemu Linux: Jeśli nie zostanie podany żaden wiersz polecenia, polecenie wsl.exe uruchomi powłokę domyślną. --exec, -e <CommandLine> Wykonuje określone polecenie bez użycia domyślnej powłoki systemu Linux. --shell-type <standard|login|none> Wykonuje określone polecenie z podanym typem powłoki. -- Przekazuje pozostałą część wiersza polecenia w niezmienionej postaci. Opcje: --cd <Directory> Ustawia określony katalog jako bieżący katalog roboczy. W przypadku użycia znaku ~ zostanie użyta ścieżka macierzysta użytkownika systemu Linux. Jeśli ścieżka rozpoczyna się od znaku /, będzie interpretowana jako ścieżka bezwzględna systemu Linux. W przeciwnym razie wartość musi być ścieżką bezwzględną systemu Windows. --distribution, -d <DistroName> Uruchamia określoną dystrybucję. --distribution-id <DistroGuid> Uruchamia określony identyfikator dystrybucji. --user, -u <UserName> Uruchamia jako określony użytkownik. --system Uruchamia powłokę dystrybucji systemu. Argumenty zarządzania podsystemem Windows dla systemu Linux: --help Wyświetla informacje o użyciu. --debug-shell Otwiera powłokę debugowania podsystemu WSL2 na potrzeby diagnostyki. --install [Distro] [Options...] Instaluje dystrybucję podsystemu Windows dla systemu Linux. Aby zapoznać się z listą prawidłowych dystrybucji, użyj polecenia 'wsl.exe --list --online'. Opcje: --enable-wsl1 Włącza obsługę podsystemu WSL1. --fixed-vhd Tworzy dysk o stałym rozmiarze do przechowywania dystrybucji. --from-file <Path> Instaluje dystrybucję z pliku lokalnego. --legacy Używa starszego manifestu dystrybucji. --location <Location> Ustawia ścieżkę instalacji dystrybucji. --name <Name> Ustawia nazwę dystrybucji. --no-distribution Instaluje tylko wymagane składniki opcjonalne, nie instaluje dystrybucji. --no-launch, -n Nie uruchamia dystrybucji po instalacji. --version <Version> Określa wersję do użycia dla nowej dystrybucji. --vhd-size <MemoryString> Określa rozmiar dysku do przechowywania dystrybucji. --web-download Pobiera dystrybucję z Internetu zamiast ze sklepu Microsoft Store. --manage <Distro> <Options...> Zmienia opcje specyficzne dla dystrybucji. Opcje: --move <Location> Przenosi dystrybucję do nowej lokalizacji. --set-sparse, -s <true|false> Ustawia dysk VHD dystrybucji jako rozrzedzony, dzięki czemu miejsce na dysku jest automatycznie odzyskiwane. --set-default-user <Username> Ustawia domyślnego użytkownika dystrybucji. --resize <MemoryString> Zmienia rozmiar dysku dystrybucji do określonego rozmiaru. --mount <Disk> Dołącza i instaluje dysk fizyczny lub wirtualny we wszystkich dystrybucjach WSL 2. Opcje: --vhd Określa, że <Disk> odwołuje się do wirtualnego dysku twardego. --bare Dołącza dysk do podsystemu WSL2, ale nie instaluje go. --name <Name> Instaluje dysk przy użyciu niestandardowej nazwy punktu instalacji. --type <Type> System plików do użycia podczas instalowania dysku; jeśli określone wartości domyślne nie są ustawione na ext4. --options <Options> Dodatkowe opcje instalacji. --partition <Index> Indeks partycji do zainstalowania; jeśli określone wartości domyślne nie są ustawione na cały dysk. --set-default-version <Version> Zmienia domyślną wersję instalacji dla nowych dystrybucji. --shutdown Natychmiast kończy działanie wszystkich uruchomionych dystrybucji i WSL 2 uproszczona maszyna wirtualna narzędzi. Opcje: --force Zakończenie maszyny wirtualnej WSL 2, nawet jeśli operacja jest w toku. Może spowodować utratę danych. --status Wyświetl stan podsystemu Windows dla systemu Linux. --unmount [Disk] Odinstalowuje i odłącza dysk od wszystkich dystrybucji podsystemu WSL2. W przypadku wywołania bez argumentu odinstalowuje i odłącza wszystkie dyski. --uninstall Odinstalowuje pakiet podsystemu systemu Windows dla systemu Linux z tego komputera. --update Aktualizowanie pakietu podsystemu systemu Windows dla systemu Linux. Opcje: --pre-release Pobieranie wersji wstępnej, jeśli jest dostępna. --version, -v Wyświetlanie informacji o wersji. Argumenty zarządzania dystrybucjami w Podsystemie Windows dla systemu Linux: --export <Distro> <FileName> [Options] Eksportuje dystrybucję do pliku tar. W przypadku wyjścia stdout jako nazwę pliku można wprowadzić -. Opcje: --format <Format> Określa format eksportu. Obsługiwane wartości: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importuje określony plik tar jako nową dystrybucję. W przypadku wejścia stdin jako nazwę pliku można wprowadzić -. Opcje: --version <Version> Określa wersję do użycia dla nowej dystrybucji. --vhd Określa, że podany plik jest plikiem .vhd lub .vhdx, a nie plikiem tar. Ta operacja tworzy kopię pliku VHD w określonej lokalizacji instalacji. --import-in-place <Distro> <FileName> Importuje określony plik VHD jako nową dystrybucję. Ten wirtualny dysk twardy musi być sformatowany przy użyciu typu systemu plików ext4. --list, -l [Options] Wyświetla listę dystrybucji. Opcje: --all Wyświetl wszystkie dystrybucje, w tym dystrybucje, które są aktualnie instalowane lub odinstalowywane. --running Wyświetl tylko dystrybucje, które są obecnie uruchomione. --quiet, -q Pokaż tylko nazwy dystrybucji. --verbose, -v Pokaż szczegółowe informacje o wszystkich dystrybucjach. --online, -o Wyświetla listę dystrybucji dostępnych do zainstalowania przy użyciu polecenia 'wsl.exe --install'. --set-default, -s <Distro> Ustawia dystrybucję jako domyślną. --set-version <Distro> <Version> Zmienia wersję określonej dystrybucji. --terminate, -t <Distro> Kończy działanie określonej dystrybucji. --unregister <Distro> Wyrejestrowuje dystrybucję i usuwa główny system plików.
pt_br: Copyright (c) Microsoft Corporation. Todos os direitos reservados. Para obter informações sobre a privacidade deste produto, visite https://aka.ms/privacy. Uso: wsl.exe [Argumento] [Opções...] [Linha de comando] Argumentos para execução de binários do Linux: Se nenhuma linha de comando for fornecida, o wsl.exe será iniciado no shell padrão. --exec, -e <CommandLine> Executa o comando especificado sem usar o shell padrão do Linux. --shell-type <standard|login|none> Executa o comando especificado com o tipo de shell fornecido. -- Passa a linha de comando restante como está. Opções: --cd <Directory> Define o diretório especificado como o diretório de trabalho atual. Se ~ for usado, o caminho da página inicial do usuário do Linux será usado. Se o caminho começar com um caractere /, será interpretado como um caminho do Linux absoluto. Caso contrário, o valor deverá ser um caminho do Windows absoluto. --distribution, -d <DistroName> Executa a distribuição especificada. --distribution-id <DistroGuid> Executa a ID da distribuição especificada. --user, -u <UserName> Executa como o usuário especificado. --system Inicia um shell para a distribuição do sistema. Argumentos para gerenciar o Subsistema do Windows para Linux: --help Exibe as informações de uso. --debug-shell Abre um shell de depuração do WSL2 para fins de diagnóstico. --install [Distribuição] [Opções...] Instala uma distribuição do Subsistema do Windows para Linux. Para uma lista de distribuições válidas, use ''wsl.exe --list --online''. Opções: --enable-wsl1 Habilita o suporte para o WSL1. --fixed-vhd Cria um disco de tamanho fixo para armazenar a distribuição. --from-file <Path> Instala uma distribuição de um arquivo local. --legacy Usa o manifesto de distribuição herdado. --location <Location> Define o caminho de instalação para a distribuição. --name <Name> Define o nome da distribuição. --no-distribution Instala apenas os componentes opcionais necessários, e não instala uma distribuição. --no-launch, -n Não inicia a distribuição após a instalação. --version <Version> Especifica a versão a ser usada para a nova distribuição. --vhd-size <MemoryString> Especifica o tamanho do disco para armazenar a distribuição. --web-download Baixa a distribuição da internet em vez da Microsoft Store. --manage <Distro> <Options...> Altera as opções específicas da distribuição. Opções: --move <Location> Move a distribuição para um novo local. --set-sparse, -s <true|false> Defina o VHD de distribuição como esparso, permitindo que o espaço em disco seja recuperado automaticamente. --set-default-user <Username> Define o usuário padrão da distribuição. --resize <MemoryString> Redimensiona o disco da distribuição para o tamanho especificado. --mount <Disk> Anexa e monta um disco físico ou virtual em todas as distribuições do WSL 2. Opções: --vhd Especifica que <Disk> refere-se a um disco rígido virtual. --bare Anexa o disco ao WSL2, mas não o monta. --name <Name> Monta o disco usando um nome personalizado para o ponto de montagem. --type <Type> O sistema de arquivos a ser usado ao montar um disco; se não especificado, o padrão é ext4. --options <Options> Opções de montagem adicionais. --partition <Index> O índice da partição a ser montada, se não especificado, por padrão, aplica-se a todo o disco. --set-default-version <Version> Altera a versão de instalação padrão para novas distribuições. --shutdown Encerra imediatamente todas as distribuições em execução e a máquina virtual utilitária leve do WSL 2. Opções: --force Encerra a máquina virtual WSL 2 mesmo que uma operação esteja em andamento. Pode causar perda de dados. --status Mostra o status do Subsistema do Windows para Linux. --unmount [Disco] Desmonta e desanexa um disco de todas as distribuições WSL2. Desmonta e desanexa todos os discos se for chamado sem argumento. --uninstall Desinstala o pacote do Subsistema do Windows para Linux deste computador. --update Atualiza o pacote do Subsistema do Windows para Linux. Opções: --pre-release Baixa uma versão de pré-lançamento, se disponível. --version, -v Exibe informações da versão. Argumentos para gerenciar as distribuições no Subsistema do Windows para Linux: --export <Distro> <FileName> [Opções] Exporta a distribuição para um arquivo tar. O nome do arquivo pode ser - para stdout. Opções: --format <Format> Especifica o formato de exportação. Valores com suporte: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Opções] Importa o arquivo tar especificado como uma nova distribuição. O nome do arquivo pode ser - para stdin. Opções: --version <Version> Especifica a versão a ser usada para a nova distribuição. --vhd Especifica que o arquivo fornecido é um arquivo .vhd ou .vhdx, não um arquivo tar. Esta operação faz uma cópia do arquivo VHD no local de instalação especificado. --import-in-place <Distro> <FileName> Importa o arquivo VHD especificado como uma nova distribuição. Este disco rígido virtual deve ser formatado com o tipo de sistema de arquivos ext4. --list, -l [Opções] Lista as distribuições. Opções: --all Lista todas as distribuições, incluindo as distribuições que estão atualmente sendo instaladas ou desinstaladas. --running Lista somente as distribuições que estão em execução no momento. --quiet, -q Mostra apenas os nomes de distribuição. --verbose, -v Mostra informações detalhadas sobre todas as distribuições. --online, -o Exibe uma lista de distribuições disponíveis para instalação com ''wsl.exe --install''. --set-default, -s <Distro> Define a distribuição como o padrão. --set-version <Distro> <Version> Altera a versão da distribuição especificada. --terminate, -t <Distro> Encerra a distribuição especificada. --unregister <Distro> Cancela o registro da distribuição e exclui o sistema de arquivos raiz.
pt_pt: Copyright (c) Microsoft Corporation. Todos os direitos reservados. Para informações de privacidade sobre este produto, visite https://aka.ms/privacy. Utilização: wsl.exe [Argument] [Options...] [CommandLine] Argumentos para executar binários do Linux: Se nenhuma linha de comandos for fornecida, o wsl.exe inicia a shell predefinida. --exec, -e <CommandLine> Executa o comando especificado sem utilizar a shell predefinida do Linux. --shell-type <standard|login|none> Executa o comando especificado com o tipo de shell fornecido. -- Passa a linha de comandos restante tal como está. Opções: --cd <Directory> Define o diretório especificado como o diretório de trabalho atual. Se ~ for utilizado, será utilizado o caminho raiz do utilizador do Linux. Se o caminho começar por um caráter /, será interpretado como caminho absoluto do Linux. Caso contrário, o valor deve ser um caminho absoluto do Windows. --distribution, -d <DistroName> Executa a distribuição especificada. --distribution-id <DistroGuid> Executa o ID da distribuição especificada. --user, -u <UserName> Executa como o utilizador especificado. --system Inicia uma shell para a distribuição do sistema. Argumentos para gerir o Subsistema Windows para Linux: --help Apresenta informações de utilização. --debug-shell Abre uma shell de depuração do WSL2 para fins de diagnóstico. --install [Distro] [Options...] Instala uma distribuição do Subsistema Windows para Linux. Para obter uma lista de distribuições válidas, utilize 'wsl.exe --list --online' Opções: --enable-wsl1 Ativa o suporte WSL1. --fixed-vhd Cria um disco de tamanho fixo para armazenar a distribuição. --from-file <Path> Instala uma distribuição a partir de um ficheiro local. --legacy Utiliza o manifesto de distribuição legado. --location <Location> Define o caminho de instalação da distribuição. --name <Name> Define o nome da distribuição. --no-distribution Instala apenas os componentes opcionais necessários. Não instala uma distribuição. --no-launch, -n Não inicia a distribuição após a instalação. --version <Version> Especifica a versão a utilizar na nova distribuição. --vhd-size <MemoryString> Especifica o tamanho do disco para armazenar a distribuição. --web-download Transfere a distribuição da Internet, em vez de pela Microsoft Store. --manage <Distro> <Options...> Altera as opções específicas da distribuição. Opções: --move <Location> Move a distribuição para uma nova localização. --set-sparse, -s <true|false> Define o VHD da distribuição para ser disperso, permitindo que o espaço em disco seja automaticamente recuperado. --set-default-user <Username> Define o utilizador predefinido da distribuição. --resize <MemoryString> Redimensiona o disco da distribuição ao tamanho especificado. --mount <Disk> Liga e monta um disco físico ou virtual em todas as distribuições do WSL 2. Opções: --vhd Especifica que <Disk> se refere a um disco rígido virtual. --bare Liga o disco ao WSL2, mas sem o montar. --name <Name> Monta o disco com um nome personalizado para o ponto de montagem. --type <Type> O sistema de ficheiros a utilizar ao montar um disco. Se não for especificado, é predefinido como ext4. --options <Options> Opções de montagem adicionais. --partition <Index> Índice da partição a montar. Se não for especificado, é predefinido para todo o disco. --set-default-version <Version> Altera a versão de instalação predefinida para novas distribuições. --shutdown Termina imediatamente todas as distribuições em execução e o WSL 2 máquina virtual utilitária leve. Opções: --force Termina a máquina virtual WSL 2 mesmo que esteja a decorrer uma operação. Pode causar perda de dados. --status Mostra o estado do Subsistema Windows para Linux. --unmount [Disk] Desmonta e desliga um disco de todas as distribuições do WSL 2. Desmonta e desliga todos os discos se for chamado sem argumento. --uninstall Desinstala o pacote do Subsistema Windows para Linux a partir deste computador. --update Atualiza o pacote do Subsistema Windows para Linux. Opções: --pre-release Transfere uma versão de pré-lançamento, se estiver disponível. --version, -v Apresenta informações da versão. Argumentos para gerir distribuições no Subsistema Windows para Linux: --export <Distro> <FileName> [Options] Exporta a distribuição para um ficheiro tar. O nome de ficheiro pode ser - para stdout. Opções: --format <Format> Especifica o formato de exportação. Valores suportados: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importa o ficheiro tar especificado como nova distribuição. O nome de ficheiro pode ser - para stdin. Opções: --version <Version> Especifica a versão a utilizar para a nova distribuição. --vhd Especifica que o ficheiro fornecido é um ficheiro .vhd ou .vhdx, não um ficheiro tar. Esta operação faz uma cópia do ficheiro VHD na localização de instalação especificada. --import-in-place <Distro> <FileName> Importa o ficheiro VHD especificado como nova distribuição. Este disco rígido virtual tem de ser formatado com o tipo de sistema de ficheiros ext4. --list, -l [Options] Lista as distribuições. Opções: --all Lista todas as distribuições, incluindo as distribuições que estão atualmente a ser instaladas ou desinstaladas. --running Lista apenas as distribuições que estão atualmente em execução. --quiet, -q Mostra apenas os nomes das distribuições. --verbose, -v Mostra informações detalhadas sobre todas as distribuições. --online, -o Mostra uma lista de distribuições disponíveis para instalação com 'wsl.exe --install'. --set-default, -s <Distro> Define a distribuição como predefinição. --set-version <Distro> <Version> Altera a versão da distribuição especificada. --terminate, -t <Distro> Termina a distribuição especificada. --unregister <Distro> Anula o registo da distribuição e elimina o sistema de ficheiros raiz.
ru_ru: (c) Корпорация Майкрософт (Microsoft Corporation). Все права защищены. Сведения о конфиденциальности этого продукта см. на странице https://aka.ms/privacy. Использование: wsl.exe [аргумент] [параметры...] [командная_строка] Аргументы для запуска двоичных файлов Linux: Если командная строка не указана, wsl.exe запускает оболочку по умолчанию. --exec, -e <CommandLine> Выполнить указанную команду без использования оболочки Linux по умолчанию. --shell-type <standard|login|none> Выполнить указанную команду с указанным типом оболочки. -- Передать оставшуюся командную строку без изменений. Параметры: --cd <Directory> Задает указанный каталог в качестве текущего рабочего каталога. Если указан символ "~", будет использоваться домашний путь пользователя Linux. Если путь начинается с символа "/", он будет интерпретироваться как абсолютный путь Linux. В противном случае значение должно быть абсолютным путем Windows. --distribution, -d <DistroName> Запуск указанного дистрибутива. --distribution-id <DistroGuid> Запуск дистрибутива с указанным ИД. --user, -u <UserName> Запуск от имени указанного пользователя. --system Запускает оболочку для дистрибутива системы. Аргументы для управления подсистемой Windows для Linux: --help Вывод сведений об использовании. --debug-shell Открыть оболочку отладки WSL2 для целей диагностики. --install [дистрибутив] [параметры...] Установить дистрибутив подсистемы Windows для Linux. Для получения списка допустимых дистрибутивов используйте 'wsl.exe --list --online'. Параметры: --enable-wsl1 Включить поддержку WSL1. --fixed-vhd Создать диск фиксированного размера для хранения дистрибутива. --from-file <Path> Установить дистрибутив из локального файла. --legacy Использовать устаревший манифест дистрибутива. --location <Location> Задать путь установки для дистрибутива. --name <Name> Задать имя дистрибутива. --no-distribution Устанавливать только необходимые дополнительные компоненты, но не дистрибутив. --no-launch, -n Не запускать дистрибутив после установки. --version <Version> Указывает версию, используемую для нового дистрибутива. --vhd-size <MemoryString> Указывает размер диска для хранения дистрибутива. --web-download Скачать дистрибутив из Интернета вместо Microsoft Store. --manage [дистрибутив] [параметры...] Изменяет определенные параметры дистрибутива. Параметры: --move <Location> Переместить дистрибутив в новое местоположение. --set-sparse, -s <true|false> Задать для VHD дистрибутива значение "разреженный", чтобы обеспечить автоматическое освобождение дискового пространства. --set-default-user <Username> Задать пользователя по умолчанию для дистрибутива. --resize <MemoryString> Изменить размер диска дистрибутива до указанного размера. --mount <Disk> Присоединяет и подключает физический или виртуальный диск во всех дистрибутивах WSL 2. Параметры: --vhd Указывает, что <Disk> относится к виртуальному жесткому диску. --bare Присоединить диск к WSL2, но не подключать его. --name <Name> Подключить диск, используя собственное имя для точки подключения. --type <Type> Файловая система, используемая при подключении диска. Если не указано, по умолчанию используется ext4. --options <Options> Дополнительные параметры подключения. --partition <Index> Индекс подключаемого раздела. Если не указано, по умолчанию используется весь диск. --set-default-version <Version> Изменяет версию установки по умолчанию для новых дистрибутивов. --shutdown Немедленно завершает все выполняющиеся дистрибутивы и упрощенную виртуальную машину служебной программы WSL 2. Параметры: --force Прервать работу виртуальной машины WSL 2, даже если операция выполняется. Может привести к потере данных. --status Показывает состояние подсистемы Windows для Linux. --unmount [диск] Отключает и отсоединяет диск от всех дистрибутивов WSL2. При вызове без аргумента отключает и отсоединяет все диски. --uninstall Удаляет с этого компьютера пакет подсистемы Windows для Linux. --update Обновление пакета подсистемы Windows для Linux. Параметры: --pre-release Скачивание предварительной версии, если она доступна. --version, -v Вывод сведений о версии. Аргументы для управления дистрибутивами в подсистеме Windows для Linux: --export <Distro> <FileName> [параметры] Экспорт дистрибутива в TAR-файл. Имя файла может быть "-" для stdout. Параметры: --format <Format> Указывает формат экспорта. Поддерживаемые значения: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [параметры] Импортирует указанный TAR-файл в качестве нового дистрибутива. Имя файла может быть "-" для stdin. Параметры: --version <версия> Указывает версию, используемую для нового дистрибутива. --vhd Указывает, что предоставленный файл является файлом VHD или VHDX, а не TAR-файлом. Эта операция создает копию VHD-файла в указанном расположении установки. --import-in-place <Distro> <FileName> Импортирует указанный VHD-файл в качестве нового дистрибутива. Этот виртуальный жесткий диск должен быть отформатирован с типом файловой системы ext4. --list, -l [параметры] Перечисление дистрибутивов. Параметры: --all Перечислить все дистрибутивы, включая дистрибутивы, которые устанавливаются или удаляются в настоящий момент. --running Перечислить только дистрибутивы, которые сейчас запущены. --quiet, -q Показывать только имена дистрибутивов. --verbose, -v Вывод подробных сведений обо всех дистрибутивах. --online, -o Вывод списка дистрибутивов, доступных для установки с помощью команды 'wsl.exe --install'. --set-default, -s <Distro> Задает дистрибутив по умолчанию. --set-version <Distro> <Version> Изменяет версию указанного дистрибутива. --terminate, -t <Distro> Прерывает работу указанного дистрибутива. --unregister <Distro> Отменяет регистрацию дистрибутива и удаляет корневую файловую систему.
sv_se: Copyright (c) Microsoft Corporation. Med ensamrätt. Sekretessinformation om den här produkten finns i https://aka.ms/privacy. Usage: wsl.exe [Argument] [Options...] [CommandLine] Argument för att köra Linux-binärfiler: Om ingen kommandorad anges startar wsl.exe standardgränssnittet. --exec, -e <CommandLine> Kör det angivna kommandot utan. --shell-type <standard|login|none> Kör det angivna kommandot med den angivna gränssnittstypen. -- Skicka den återstående kommandoraden som den är. Alternativ: --cd <Directory> Anger den angivna katalogen som aktuell arbetskatalog. Om ~ används används Linux-användarens hemsökväg. Om sökvägen börjar med ett/-tecken tolkas den som en absolut Linux-sökväg. Annars måste värdet vara en absolut Windows-sökväg. --distribution, -d <DistroName> Kör den angivna distributionen. --distribution-id <DistroGuid> Kör det angivna distributions-ID:t. --user, -u <UserName> Kör som angiven användare. --system Startar ett gränssnitt för systemdistributionen. Argument för att hantera Windows-undersystem för Linux: --help Visa användningsinformation. --debug-shell Öppna ett WSL2-felsökningsgränssnitt i diagnostiksyfte. --install [Distro] [Alternativ...] Installera en Windows-undersystem för Linux distribution. Använd 'wsl.exe --list --online' för en lista över giltiga distributioner'. Alternativ: --enable-wsl1 Aktivera WSL1-stöd. --fixed-vhd Skapa en disk med fast storlek för att lagra distributionen. --from-file <Path> Installera en distribution från en lokal fil. --legacy Använd det äldre distributionsmanifestet. --location <Location> Ange installationssökvägen för distributionen. --name <Name> Ange namnet på distributionen. --no-distribution Installera endast nödvändiga valfria komponenter, installerar inte någon distribution. --no-launch, -n Starta inte distributionen efter installationen. --version <Version> Anger vilken version som ska användas för den nya distributionen. --vhd-size <MemoryString> Anger storleken på den disk som distributionen ska lagras på. --web-download Ladda ned distributionen från Internet i stället för Microsoft Store. --manage <Distro> <Options...> Distributionsalternativ för ändringar. Alternativ: --move <Location> Flytta distributionen till en ny plats. --set-sparse, -s <true|false> Ange att den virtuella hårddisken för distribution ska vara sparse, vilket gör att diskutrymmet kan frigöras automatiskt. --set-default-user <Username> Ange standardanvändaren för fördelningen. --resize <MemoryString> Ändra storlek på disken för fördelningen till den angivna storleken. --mount <Disk> Ansluter och monterar en fysisk eller virtuell disk i alla WSL 2-distributioner. Alternativ: --vhd Anger att <Disk> refererar till en virtuell hårddisk. --bare Anslut disken till WSL2, men montera den inte. --name <Name> Montera disken med ett anpassat namn för monteringspunkten. --type <Type> Filsystem som ska användas vid montering av en disk, om inget standardvärde anges till ext4. --options <Options> Ytterligare monteringsalternativ. --partition <Index> Index för partitionen som ska monteras, om det inte anges som standard för hela disken. --set-default-version <Version> Ändrar standardinstallationsversionen för nya distributioner. --shutdown Avslutar omedelbart alla distributioner som körs och den virtuella WSL 2- lightweight utility virtual machine. Alternativ: --force Avsluta den virtuella WSL 2-datorn även om en åtgärd pågår. Kan orsaka dataförlust. --status Visa status för Windows-undersystem för Linux. --unmount [Disk] Demonterar och kopplar bort en disk från alla WSL2-distributioner. Demonterar och kopplar bort alla diskar om det anropas utan argument. --uninstall Avinstallerar Windows-undersystem för Linux paketet från den här datorn. --update Uppdatera Windows-undersystem för Linux-paketet. Alternativ: --pre-release Ladda ned en förhandsversion om tillgänglig. --version, -v Visa versionsinformation. Arguments for managing Argument för att hantera distributioner i Windows-undersystem för Linux: --export <Distro> <FileName> [Options] Exporterar distributionen till en tar-fil. Filnamnet kan vara - för stdout. Alternativ: --format <Format> S Anger exportformatet. Värden som stöds: tar, tar.gz, tar.xz, vhd. --import <Distro> <InstallLocation> <FileName> [Options] Importerar den angivna tar-filen som en ny distribution. Filnamnet kan vara - för stdin. Alternativ: --version <Version> Anger vilken version som ska användas för den nya distributionen. --vhd Anger att den angivna filen är en VHD- eller VHDX-fil, inte en tar-fil. ThDen här åtgärden gör en kopia av VHD-filen på den angivna installationsplatsen. --import-in-place <Distro> <FileName> Importerar den angivna VHD-filen som en ny distribution. Den här virtuella hårddisken måste formateras med filsystemtypen ext4. --list, -l [Options] Visar distributioner. Alternativ: --all Lista alla distributioner, inklusive distributioner som håller på att installeras eller avinstalleras. --running Lista endast distributioner som körs för närvarande. --quiet, -q Visa endast distributionsnamn. --verbose, -v Visa detaljerad information om alla distributioner. --online, -o Visar en lista över tillgängliga distributioner för installation med 'wsl.exe --install'. --set-default, -s <Distro> Anger fördelningen som standard --set-version <Distro> <Version> Ändrar versionen av den angivna distributionen. --terminate, -t <Distro> Avslutar den angivna distributionen. --unregister <Distro> Avregistrerar distributionen och tar bort rotfilsystemet.
tr_tr: Telif Hakkı (c) Microsoft Corporation. Tüm hakları saklıdır. Bu ürünle ilgili gizlilik bilgileri için lütfen https://aka.ms/privacy sayfasını ziyaret edin. Kullanım: wsl.exe [Bağımsız Değişken] [Seçenekler...] [KomutSatırı] Linux ikili dosyalarını çalıştırmak için bağımsız değişkenler: Komut satırı sağlanmamışsa wsl.exe varsayılan kabuğu başlatır. --exec, -e <CommandLine> Varsayılan Linux kabuğunu kullanmadan belirtilen komutu yürütür. --shell-type <standard|login|none> Belirtilen komutu sağlanan kabuk türüyle yürütür. -- Kalan komut satırını olduğu gibi geçirir. Seçenekler: --cd <Directory> Belirtilen dizini geçerli çalışma dizini olarak ayarlar. ~ kullanılıyorsa Linux kullanıcı giriş yolu kullanılır. Yol / karakteriyle başlarsa mutlak bir Linux yolu olarak yorumlanır. Aksi takdirde değerin mutlak bir Windows yolu olması gerekir. --distribution, -d <DistroName> Belirtilen dağıtımı çalıştırır. --distribution-id <DistroGuid> Belirtilen dağıtım kimliğini çalıştırır. --user, -u <UserName> Belirtilen kullanıcı olarak çalıştırır. --system Sistem dağıtımı için bir kabuk başlatır. Linux için Windows Alt Sistemini yönetmeyi sağlayan bağımsız değişkenler: --help Kullanım bilgilerini görüntüler. --debug-shell Tanılama amacıyla bir WSL2 hata ayıklama kabuğu açar. --install [Dağıtım] [Seçenekler...] Linux için Windows Alt Sistemi dağıtımı yükler. Geçerli dağıtımların listesi için 'wsl.exe --list --online' kullanın. Seçenekler: --enable-wsl1 WSL1 desteğini etkinleştirir. --fixed-vhd Dağıtımı depolamak için sabit boyutlu bir disk oluşturun. --from-file <Path> Yerel dosyadan bir dağıtım yükler. --legacy Eski dağıtım bildirimini kullanır. --location <Location> Dağıtımın yükleme yolunu ayarlar. --name <Name> Dağıtımın adını ayarlar. --no-distribution Yalnızca gerekli isteğe bağlı bileşenleri yükler, dağıtımı yüklemez. --no-launch, -n Yüklemeden sonra dağıtımı başlatmaz. --version <Version> Yeni dağıtım için kullanılacak sürümü belirtir. --vhd-size <MemoryString> Dağıtımın depolanacağı diskin boyutunu belirtir. --web-download Dağıtımı Microsoft Store yerine internetten indirir. --manage <Distro> <Options...> Dağıtıma özgü seçenekleri değiştirir. Seçenekler: --move <Location> Dağıtımı yeni bir konuma taşır. --set-sparse, -s <true|false> Dağıtım VHD'inin aralıklı olacak şekilde ayarlar ve böylece disk alanının otomatik olarak geri kazanılmasını sağlar. --set-default-user <Username> Dağıtımın varsayılan kullanıcısını ayarlar. --resize <MemoryString> Dağıtımın diskini belirtilen boyuta yeniden boyutlandırır. --mount <Disk> Tüm WSL 2 dağıtımlarında fiziksel veya sanal diski ekler ve bağlar. Seçenekler: --vhd <Disk>'in sanal bir sabit diske başvurduğunu belirtir. --bare Diski WSL2'ye ekler, ancak bağlamaz. --name <Name> Bağlama noktası için özel bir ad kullanarak diski bağlar. --type <Type> Bir diski takarken dosya sistemi kullanılır, belirtilmemişse varsayılan ext4 olur. --options <Options> Ek bağlama seçenekleri. --partition <Index> Bağlanacak bölümün dizini, belirtilmemişse varsayılan olarak tüm diske ayarlanır. --set-default-version <Version> Yeni dağıtımlar için varsayılan yükleme sürümünü değiştirir. --shutdown Çalışan tüm dağıtımları ve WSL 2 basit yardımcı yazılım sanal makinesini anında sonlandırır. Seçenekler: --force Devam eden bir işlem olsa bile WSL 2 sanal makinesini sonlandırın. Veri kaybına neden olabilir. --status Linux için Windows Alt Sistemi'nin durumunu gösterir. --unmount [Disk] Bir diskin tüm WSL2 dağıtımlarından bağlantısını keser ve ayırır. Bağımsız değişken olmadan çağrılırsa tüm disklerin bağlantısını keser ve ayırır. --uninstall Bu makineden Linux için Windows Alt Sistemi paketini kaldırır. --update Linux için Windows Alt Sistemi'nin durumunu güncelleştirir. Seçenekler: --pre-release Varsa bir yayın öncesi sürümü indirir. --version, -v Sürüm bilgilerini görüntüler. Linux için Windows Alt Sistemi'nde dağıtımı yönetmek için bağımsız değişkenler: --export <Distro> <FileName> [Seçenekler] Dağıtımı bir tar dosyasına dışarı aktarır. Dosya adı - for stdout olabilir. Seçenekler: --format <Format> Dışarı aktarma biçimini belirtir. Desteklenen değerler: tar, tar.gz, vhd. --import <Distro> <InstallLocation> <FileName> [Seçenekler] Belirtilen tar dosyasını yeni bir dağıtım olarak içeri aktarır. Dosya adı - for stdin olabilir. Seçenekler: --version <Version> Yeni dağıtım için kullanılacak sürümü belirtir. --vhd Sağlanan dosyanın tar dosyası değil, .vhd veya .vhdx dosyası olduğunu belirtir. Bu işlem, belirtilen yükleme konumunda VHD dosyasının bir kopyasını oluşturur. --import-in-place <Distro> <FileName> Belirtilen VHD dosyasını yeni bir dağıtım olarak içeri aktarır. Bu sanal sabit diskin ext4 dosya sistemi türüyle biçimlendirilmesi gerekir. --list, -l [Seçenekler] Dağıtımları listeler. Seçenekler: --all Şu anda yüklenmekte veya kaldırılmakta olan dağıtımlar da dahil olmak üzere tüm dağıtımları listeler. --running Yalnızca şu anda çalışmakta olan dağıtımları listeler. --quiet, -q Yalnızca dağıtım adlarını gösterir. --verbose, -v Tüm dağıtımlar hakkında ayrıntılı bilgi gösterir. --online, -o 'wsl.exe --install' ile yüklenebilecek kullanılabilir dağıtımların listesini görüntüler. --set-default, -s <Distro> Dağıtımı varsayılan olarak ayarlar. --set-version <Distro> <Version> Belirtilen dağıtımın sürümünü değiştirir. --terminate, -t <Distro> Belirtilen dağıtımı sonlandırır. --unregister <Distro> Dağıtımın kaydını siler ve kök dosya sistemini siler.
zh_cn: 版权所有 (c) Microsoft Corporation。保留所有权利。 有关此产品的隐私信息，请访问 https://aka.ms/privacy。 用法: wsl.exe [Argument][Options...][CommandLine] 运行 Linux 二进制文件的参数: 如果未提供命令行，wsl.exe 将启动默认 shell。 --exec, -e <CommandLine> 在不使用默认 Linux shell 的情况下执行指定的命令。 --shell-type <standard|login|none> 使用提供的 shell 类型执行指定的命令。 -- 按原样传递剩余的命令行。 选项: --cd <Directory> 将指定目录设置为当前工作目录。 如果使用 ~，则将使用 Linux 用户的主路径。如果路径以 / 字符开始，它将被解释为绝对 Linux 路径。 否则，该值必须是绝对 Windows 路径。 --distribution, -d <DistroName> 运行指定的发行版。 --distribution-id <DistroGuid> 运行指定的发行版 ID。 --user, -u <UserName> 以指定用户身份运行。 --system 为系统发行版启动 shell。 用于管理适用于 Linux 的 Windows 子系统的参数: --help 显示使用情况信息。 --debug-shell 出于诊断目的打开 WSL2 调试 shell。 --install [Distro] [Options...] 安装适用于 Linux 的 Windows 子系统发行版。 有关有效发行版的列表，请使用 'wsl.exe --list --online'。 选项: --enable-wsl1 启用 WSL1 支持。 --fixed-vhd 创建固定大小的磁盘来存储发行版。 --from-file <Path> 从本地文件安装发行版。 --legacy 使用旧发行版清单。 --location <Location> 设置发行版的安装路径。 --name <Name> 设置发行版的名称。 --no-distribution 仅安装所需的可选组件，不安装发行版。 --no-launch, -n 安装后不要启动发行版。 --version <Version> 指定要用于新分发的版本。 --vhd-size <MemoryString> 指定用于存储发行版的磁盘的大小。 --web-download 从 Internet 而不是 Microsoft Store 下载发行版。 --manage <Distro> <Options...> 更改发行版特定选项。 选项: --move <Location> 将发行版移到新位置。 --set-sparse, -s <true|false> 将发行版的 VHD 设置为稀疏，从而允许自动回收磁盘空间。 --set-default-user <Username> 设置发行版的默认用户。 --resize <MemoryString> 将发行版的磁盘大小调整为指定大小。 --mount <Disk> 在所有 WSL 2 发行版中附加和装载物理磁盘或虚拟磁盘。 选项: --vhd 指定 <Disk> 引用虚拟硬盘。 --bare 将磁盘附加到 WSL2，但不要装载它。 --name <Name> 使用装入点的自定义名称装载磁盘。 --type <Type> 装载磁盘时要使用的文件系统(如果未指定)默认为 ext4。 --options <Options> 其他装载选项。 --partition <Index> 要装载的分区的索引(如果未指定)默认为整个磁盘。 --set-default-version <Version> 更改新发行版的默认安装版本。 --shutdown 立即终止所有正在运行的发行版和 WSL 2 轻型实用工具虚拟机。 选项: --force 即使正在执行操作，也终止 WSL 2 虚拟机。可能导致数据丢失。 --status 显示适用于 Linux 的 Windows 子系统状态。 --unmount [磁盘] 从所有 WSL2 发行版中卸载和分离磁盘。 如果在没有参数的情况下调用，则卸载和分离所有磁盘。 --uninstall 从此计算机卸载适用于 Linux 的 Windows 子系统包。 --update 更新适用于 Linux 的 Windows 子系统包。 选项: --pre-release 下载预发行版本(如果可用)。 --version, -v 显示版本信息。 用于在适用于 Linux 的 Windows 子系统中管理发行版的参数: --export <Distro> <FileName> [选项] 将发行版导出到 tar 文件。 文件名可以是 - for stdout。 选项: --format <Format> 指定导出格式。支持的值: tar、tar.gz、tar.xz、vhd。 --import <Distro> <InstallLocation> <FileName> [选项] 将指定的 tar 文件作为新发行版导入。 文件名可以是 - for stdin。 选项: --version <Version> 指定要用于新分发的版本。 --vhd 指定所提供的文件是 .vhd 还是 .vhdx 文件，而不是 tar 文件。 此操作在指定的安装位置创建 VHD 文件的副本。 --import-in-place <Distro> <FileName> 将指定的 VHD 文件作为新发行版导入。 必须使用 ext4 文件系统类型设置此虚拟硬盘的格式。 --list, -l [选项] 列出发行版。 选项: --all 列出所有发行版，包括当前 正在安装或卸载的发行版。 --running 仅列出当前正在运行的发行版。 --quiet, -q 仅显示发行版名称。 --verbose, -v 显示有关所有发行版的详细信息。 --online, -o 显示适合通过 'wsl --install' 安装的可用发行版列表。 --set-default, -s <Distro> 将分布版设置为默认值。 --set-version <Distro> <Version> 更改指定发行版的版本。 --terminate, -t <Distro> 终止指定的发行版。 --unregister <Distro> 取消注册发行版并删除根文件系统。
zh_tw: Copyright (c) Microsoft Corporation. 著作權所有，並保留一切權利。 如需有關此產品的隱私權資訊，請造訪 https://aka.ms/privacy。 使用方式: wsl.exe [Argument] [Options...] [CommandLine] 用於執行 Linux 二進位檔的引數: 如果未提供任何命令列，wsl.exe 會啟動預設殼層。. --exec, -e <CommandLine> 執行指定的命令，而不使用預設的 Linux 殼層。 --shell-type <standard|login|none> 使用提供的殼層類型執行指定的命令。. -- 依原樣傳遞其餘的命令列。 選項: --cd <Directory> 將指定的目錄設定為目前的工作目錄。 如果使用 ~，則會使用 Linux 使用者的常用路徑。如果路徑的開頭為 / 字元，它則會被解譯為絕對 Linux 路徑。 否則，該值必須是絕對 Windows 路徑。 --distribution, -d <DistroName> 執行指定的發佈。 --distribution-id <DistroGuid> 執行指定的發佈識別碼。 --user, -u <UserName> 以指定使用者身分執行。 --system 啟動系統發佈的殼層。 用於管理 Linux 版 Windows 子系統的引數: --help 顯示使用方式資訊。 --debug-shell 開啟用於診斷用途的 WSL2 偵錯殼層。 --install [Distro] [Options...] 安裝 Linux 版 Windows 子系統發行版本。 如需有效發行版本的清單，請使用 'wsl.exe --list --online'。 選項: --enable-wsl1 啟用 WSL1 支援。 --fixed-vhd 建立大小固定的磁碟，以儲存發佈。 --from-file <Path> 從本機檔案安裝發佈。 --legacy 使用舊版發佈資訊清單。 --location <Location> 設定發佈的安裝路徑。 --name <Name> 設定發佈的名稱。 --no-distribution 僅安裝必須的選擇性元件，不安裝發行版本。 --no-launch, -n 安裝後請勿啟動發佈。 --version <Version> 指定要用於新發佈的版本。 --vhd-size <MemoryString> 指定磁碟大小，以儲存發佈。 --web-download 從網際網路下載發佈，而非從 Microsoft Store 下載。 --manage <Distro> <Options...> 變更 distro 指定選項。 選項: --move <Location> 將發佈移動到新位置。 --set-sparse, -s <true|false> 將 distro 的 VHD 設為疏鬆，允許磁碟空格自動回收。 --set-default-user <Username> 設定發佈的預設使用者。 --resize <MemoryString> 將發佈的磁碟大小調整為指定大小。 --mount <Disk> 在所有 WSL 2 發行版本中連結和掛接實體或虛擬磁碟。 選項: --vhd 指定 <Disk> 參考虛擬硬碟。 --bare 將磁碟連結到 WSL2，但不要掛接。 --name <Name> 使用掛接點的自訂名稱掛接磁碟。 --type <Type> 掛接磁碟時要使用的檔案系統，如果未指定，則預設為 ext4。 --options <Options> 其他掛接選項。 --partition <Index> 要掛接之磁碟分割的索引，如果未指定，則預設為整個磁碟。 --set-default-version <Version> 為新的發行版本變更預設安裝版本。 --shutdown 立即終止所有正在執行的發行版本和 WSL 2 輕量型公用程式虛擬機器。 選項: --force 結束 WSL 2 虛擬機器，即使作業正在進行中。可能會造成資料遺失。 --status 顯示 Linux 版 Windows 子系統的狀態。 --unmount [Disk] 從所有 WSL2 發行版本卸載並中斷連結磁碟。 如果呼叫時沒有引數，則卸載並中斷連結所有磁碟。 --uninstall 從此電腦取消安裝 Linux 套件的 Windows 子系統。 --update 更新 Linux 版 Windows 子系統套件。 選項: --pre-release 下載預先發行版本 (如果有提供)。 --version, -v 顯示版本資訊。 用於在 Linux 版 Windows 子系統中管理發行版本的引數: --export <Distro> <FileName> [Options] 將發行版本匯出至 tar 檔案。 stdout 的檔案名稱可以是 -。 選項: --format <Format> 指定匯出格式。支援的值: tar、tar.gz、tar.xz、vhd。 --import <Distro> <InstallLocation> <FileName> [Options] 匯入指定的 tar 檔案以做為新發行版本。 標準輸出的檔案名稱可以是 -。 選項: --version <Version> 指定要用於新發行版本的版本。 --vhd 指定提供的檔案是 .vhd 或 .vhdx 檔案，而不是 tar 檔案。 此作業會在指定的安裝位置複製 .vhdx 檔案。 --import-in-place <Distro> <FileName> 匯入指定的 VHD 檔案以做為新發行版本。 此虛擬硬碟必須格式化為 ext4 檔案系統類型。 --list, -l [Options] 列出發行版本。 Options: --all 列出所有發行版本，包括 目前正在安裝或解除安裝的發行版本。 --running 僅列出目前正在執行的發行版本。 --quiet, -q 只顯示發行版本名稱。 --verbose, -v 顯示所有發行版本的詳細資訊 --online, -o 顯示可使用 'wsl.exe --install' 安裝的可用發行版本清單。 --set-default, -s <Distro> 將發行版本設定為預設值。 --set-version <Distro> <Version> 變更指定發行版本的版本。 --terminate, -t <Distro> 終止指定的發行版本。 --unregister <Distro> 取消註冊發行版本並刪除根檔案系統。
